000100120214      *-----------------------------------------------------------------
000200120203      * Program to test Data types (primitives) from EGL iSeries access
000300000000      *-----------------------------------------------------------------
000400120203
000800000000       IDENTIFICATION DIVISION.
000900120203       PROGRAM-ID.    EDTTSTP.
001000000000       AUTHOR.                 NONE
001100000000           INSTALLATION.       NONE
001200120203           DATE WRITTEN.       2/5/2012.
001300000000           DATE COMPILED.
001400000000       ENVIRONMENT DIVISION.
001500000000       CONFIGURATION SECTION.
001600000000       SPECIAL-NAMES.
006100120207       INPUT-OUTPUT SECTION.
006101120207       FILE-CONTROL.
006300000000       DATA DIVISION.
006400000000
006500000000       WORKING-STORAGE SECTION.
024600000000       01  CL-CMD.
024700000000           05  CL-CMD-DATA.
024800000000              10  CL-CMD-OVRDBF PIC X(7) VALUE "OVRDBF ".
024900000000              10  CL-CMD-OLDFILE PIC X(11).
025000000000              10  CL-CMD-NEWFILE PIC X(33).
025100000000              10  CL-CMD-SECURE  PIC X(12) VALUE "SECURE(*YES)".
025200000000           05  CL-CMD-LENGTH PIC 9(10)V9(5) COMP-3 VALUE 63.
056800120214
056802120214       LINKAGE SECTION.
056803120214
059300120606       01  CHAR20      PIC X(20).
059301120606       01  LCHAR20     PIC X(20).
059302120606       01  UNICODE20   PIC N(20) USAGE NATIONAL.
059303120606       01  LUNICODE20  PIC N(20) USAGE NATIONAL.
059304120606       01  BIN2SIGN    PIC S9(4) COMP-4.
059305120207       01  BIN4SIGN    PIC S9(9) COMP-4.
059306120207       01  BIN8SIGN    PIC S9(18) COMP-4.
059307120207       01  DEC112      PIC S9(9)V9(2) COMP-3.
059308120214       01  DEC15       PIC S9(15) COMP-3.
059309120214       01  NUM6        PIC S9(6).
059310120214       01  NUM103      PIC S9(7)V9(3).
059311120214       01  BIN2        PIC 9(4) COMP-4.
059312120207       01  BIN4        PIC 9(9) COMP-4.
059313120213       01  DATE1.
059314120612           03 DATE1-YYYY PIC 9(4) USAGE DISPLAY.
059315120213           03 FILLER   PIC X(1).
059316120612           03 DATE1-MM PIC 9(2) USAGE DISPLAY.
059317120213           03 FILLER   PIC X(1).
059318120612           03 DATE1-DD PIC 9(2) USAGE DISPLAY.
059319120213       01  DATE2.
059320120612           03 DATE2-MM PIC 9(2) USAGE DISPLAY.
059321120213           03 FILLER   PIC X(1).
059322120612           03 DATE2-DD PIC 9(2) USAGE DISPLAY.
059323120213           03 FILLER   PIC X(1).
059324120612           03 DATE2-YYYY PIC 9(4) USAGE DISPLAY.
059325120213       01  DATE3.
059326120612           03 DATE3-MM PIC 9(2) USAGE DISPLAY.
059327120612           03 DATE3-DD PIC 9(2) USAGE DISPLAY.
059328120612           03 DATE3-YYYY PIC 9(4) USAGE DISPLAY.
059329120606       01  TIME1.
059330120612           03 TIME1-HH PIC 9(2) USAGE DISPLAY.
059331120606           03 FILLER   PIC X(1).
059332120612           03 TIME1-MM  PIC 9(2) USAGE DISPLAY.
059333120606           03 FILLER   PIC X(1).
059334120612           03 TIME1-SS PIC 9(2) USAGE DISPLAY.
059335120606       01  TIME2.
059336120612           03 TIME2-SS PIC 9(2) USAGE DISPLAY.
059337120606           03 FILLER   PIC X(1).
059338120612           03 TIME2-MM PIC 9(2) USAGE DISPLAY.
059339120606           03 FILLER   PIC X(1).
059340120612           03 TIME2-HH PIC 9(2) USAGE DISPLAY.
059341120606       01  TIME3.
059342120612           03 TIME3-SS PIC 9(2) USAGE DISPLAY.
059343120612           03 TIME3-MM PIC 9(2) USAGE DISPLAY.
059345120612           03 TIME3-HH PIC 9(2) USAGE DISPLAY.
059347120606       01  TIMESTAMP1.
059348120612           03 TS-YYYY  PIC 9(4) USAGE DISPLAY.
059349120213           03 FILLER   PIC X(1).
059350120612           03 TS-MM    PIC 9(2) USAGE DISPLAY.
059351120213           03 FILLER   PIC X(1).
059352120612           03 TS-DD    PIC 9(2) USAGE DISPLAY.
059353120213           03 FILLER   PIC X(1).
059354120612           03 TS-HH    PIC 9(2) USAGE DISPLAY.
059355120213           03 FILLER   PIC X(1).
059356120612           03 TS-MIN   PIC 9(2) USAGE DISPLAY.
059357120213           03 FILLER   PIC X(1).
059358120612           03 TS-SS    PIC 9(2) USAGE DISPLAY.
059359120214           03 FILLER   PIC X(1).
059360120612           03 TS-MS    PIC 9(6) USAGE DISPLAY.
059361120214       01  FLOAT4      COMP-1.
059362120210       01  FLOAT8      COMP-2.
059363120211
059364120210
059700000000       PROCEDURE DIVISION USING
059800120606                   CHAR20
059801120606                   LCHAR20
059802120606                   UNICODE20
059803120606                   LUNICODE20
059804120606                   BIN2SIGN
059805120207                   BIN4SIGN
059806120207                   BIN8SIGN
059807120207                   DEC112
059808120214                   DEC15
059809120207                   NUM6
059810120214                   NUM103
059811120207                   BIN2
059812120210                   BIN4
059813120211                   DATE1
059814120213                   DATE2
059815120213                   DATE3
059816120606                   TIME1
059817120606                   TIME2
059818120606                   TIME3
059819120606                   TIMESTAMP1
059820120210                   FLOAT4
059821120213                   FLOAT8.
059822120211
059900000000      *-----------------------------------------------------------------
060000000000      * MAIN PROCESS
060100000000      *-----------------------------------------------------------------
060200120203       MAIN-PARA SECTION.
060201120207
060202120606           DISPLAY "CHAR20 = " CHAR20
060203120606           DISPLAY "LCHAR20 = " LCHAR20
060204120606           DISPLAY "UNICODE20 = " UNICODE20
060205120606           DISPLAY "LUNICODE20 = " LUNICODE20
060206120606           DISPLAY "BIN2SIGN = " BIN2SIGN
060207120207           DISPLAY "BIN4SIGN = " BIN4SIGN
060208120207           DISPLAY "BIN8SIGN = " BIN8SIGN
060209120207           DISPLAY "DEC112 = " DEC112
060210120214           DISPLAY "DEC15 = " DEC15
060211120214           DISPLAY "NUM6 = " NUM6
060212120214           DISPLAY "NUM103 = " NUM103
060213120214           DISPLAY "BIN2 = " BIN2
060214120207           DISPLAY "BIN4 = " BIN4
060215120210           DISPLAY "DATE1 = " DATE1
060216120213           DISPLAY "DATE2 = " DATE2
060217120213           DISPLAY "DATE3 = " DATE3
060218120606           DISPLAY "TIME1 = " TIME1
060219120606           DISPLAY "TIME2 = " TIME2
060220120606           DISPLAY "TIME3 = " TIME3
060221120606           DISPLAY "TIMESTAMP1 = " TIMESTAMP1
060222120210           DISPLAY "FLOAT4 = " FLOAT4
060223120210           DISPLAY "FLOAT8 = " FLOAT8
060224120211
060225120213
060226120214           MOVE "YYYYY" TO CHAR20(5:5)
060227120606           MOVE "YYYYY" TO LCHAR20(5:5)
060228120606           MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060229120214               TO UNICODE20(5:10)
060230120606           MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060231120606               TO LUNICODE20(5:10)
060232120606           COMPUTE BIN2SIGN = BIN2SIGN + 98
060233120207           COMPUTE BIN4SIGN = BIN4SIGN + 998
060234120207           COMPUTE BIN8SIGN = BIN8SIGN + 9998
060235120207           COMPUTE DEC112 = DEC112 + 998
060236120214           COMPUTE DEC15 = DEC15 + 998
060237120214           COMPUTE NUM6 = NUM6 + 9998
060238120214           COMPUTE NUM103 = NUM103 + 9998
060239120214           COMPUTE BIN2 = BIN2 + 98
060240120207           COMPUTE BIN4 = BIN4 + 998
060241120606      *    DATE1 FORMAT YYYY-MM-DD
060253120213           COMPUTE DATE1-YYYY = DATE1-YYYY + 5
060254120213           COMPUTE DATE1-MM = DATE1-MM + 5
060255120213           COMPUTE DATE1-DD = DATE1-DD + 5
060256120213
060257120213      *    DATE2 FORMAT MM/DD/YYYY
060258120213           COMPUTE DATE2-YYYY = DATE2-YYYY + 5
060259120213           COMPUTE DATE2-MM = DATE2-MM + 5
060260120213           COMPUTE DATE2-DD = DATE2-DD + 5
060261120213
060262120213      *    DATE3 FORMAT MMDDYYYY
060263120213           COMPUTE DATE3-YYYY = DATE3-YYYY + 5
060264120213           COMPUTE DATE3-MM = DATE3-MM + 5
060265120213           COMPUTE DATE3-DD = DATE3-DD + 5
060266120213
060267120606      *    TIME1 FORMAT YYYY-MM-DD
060268120606           COMPUTE TIME1-HH = TIME1-HH + 5
060269120606           COMPUTE TIME1-MM = TIME1-MM + 5
060270120606           COMPUTE TIME1-SS = TIME1-SS + 5
060271120606
060272120606      *    TIME2 FORMAT MM/DD/YYYY
060273120606           COMPUTE TIME2-HH = TIME2-HH + 5
060274120606           COMPUTE TIME2-MM = TIME2-MM + 5
060275120612           COMPUTE TIME2-SS = TIME2-SS + 5
060276120606
060277120606      *    TIME3 FORMAT MMDDYYYY
060278120606           COMPUTE TIME3-HH = TIME3-HH + 5
060279120606           COMPUTE TIME3-MM = TIME3-MM + 5
060280120606           COMPUTE TIME3-SS = TIME3-SS + 5
060281120606
060282120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060283120213           COMPUTE TS-YYYY = TS-YYYY + 5
060284120213           COMPUTE TS-MM = TS-MM + 5
060285120213           COMPUTE TS-DD = TS-DD + 5
060286120213           COMPUTE TS-HH = TS-HH + 5
060287120213           COMPUTE TS-MIN = TS-MIN + 5
060288120213           COMPUTE TS-SS = TS-SS + 5
060289120213
060290120213      *     MOVE "1999-03-15-03.15.54" TO TIMESTAMP1
060291120213
060292120210           COMPUTE FLOAT4 = FLOAT4 + 9.9e-1
060293120210           COMPUTE FLOAT8 = FLOAT8 + 9.9e-1
060294120211
060295120213           DISPLAY "CHAR20 = " CHAR20
060296120214           DISPLAY "UNICODE20 = " UNICODE20
060297120606           DISPLAY "LCHAR20 = " LCHAR20
060298120606           DISPLAY "LUNICODE20 = " LUNICODE20
060299120606           DISPLAY "DATE1 = " DATE1
060300120213           DISPLAY "DATE2 = " DATE2
060301120213           DISPLAY "DATE3 = " DATE3
060302120213
060303120606           DISPLAY "TIME1 = " TIME1
060304120606           DISPLAY "TIME2 = " TIME2
060305120606           DISPLAY "TIME3 = " TIME3
060306120606           DISPLAY "TIMESTAMP1 = " TIMESTAMP1
060307120203           PERFORM PARA-1.
060308120203
060400000000           GOBACK.
060500000000
062100120203       PARA-1 SECTION.
063100000000           CONTINUE.
063200120203       PARA-1-X.
063300000000           EXIT.
063400000000
104700000000
104800000000      *-----------------------------------------------------------------
104900120203      * END OF PROGRAM EDTTSTP
105000000000      *-----------------------------------------------------------------
