000100000000      *-----------------------------------------------------------------
000200120203      * Program to test Data types (primitives) from EGL iSeries access
000300000000      *-----------------------------------------------------------------
000400120203
000800000000       IDENTIFICATION DIVISION.
000900120213       PROGRAM-ID.    EDTTSTRA.
001000000000       AUTHOR.                 NONE
001100000000           INSTALLATION.       NONE
001200120203           DATE WRITTEN.       2/5/2012.
001300000000           DATE COMPILED.
001400000000       ENVIRONMENT DIVISION.
001500000000       CONFIGURATION SECTION.
001600000000       SPECIAL-NAMES.
006100120207       INPUT-OUTPUT SECTION.
006101120207       FILE-CONTROL.
006300000000       DATA DIVISION.
006400000000
006500000000       WORKING-STORAGE SECTION.
006501120216       01 CNTR1 PIC 9(1) COMP-4.
006502120216       01 CNTR2 PIC 9(1) COMP-4.
006503120216       01  CL-CMD.
024700000000           05  CL-CMD-DATA.
024800000000              10  CL-CMD-OVRDBF PIC X(7) VALUE "OVRDBF ".
024900000000              10  CL-CMD-OLDFILE PIC X(11).
025000000000              10  CL-CMD-NEWFILE PIC X(33).
025100000000              10  CL-CMD-SECURE  PIC X(12) VALUE "SECURE(*YES)".
025200000000           05  CL-CMD-LENGTH PIC 9(10)V9(5) COMP-3 VALUE 63.
056800000000       LINKAGE SECTION.
059200120203
059201120213       01 TYPERECS.
059202120216          03 RECORD11 OCCURS 5 TIMES.
059203120216               04 RECORD1.
059204120606                   05  CHAR20      PIC X(20).
059205120606                   05  LCHAR20     PIC X(20).
059206120606                   05  UNICODE20   PIC N(20) USAGE NATIONAL.
059207120606                   05  LUNICODE20  PIC N(20) USAGE NATIONAL.
059208120606                   05  BIN2SIGN    PIC S9(4) COMP-4.
059209120216                   05  BIN4SIGN    PIC S9(9) COMP-4.
059210120216                   05  BIN8SIGN    PIC S9(18) COMP-4.
059211120216                   05  DEC112      PIC S9(9)V9(2) COMP-3.
059212120216                   05  DEC15       PIC S9(15) COMP-3.
059213120216                   05  NUM6        PIC S9(6).
059214120216                   05  NUM103      PIC S9(7)V9(3).
059215120216                   05  BIN2        PIC 9(4) COMP-4.
059216120216                   05  BIN4        PIC 9(9) COMP-4.
059217120216                   05  DATE1.
059218120612                       10 DATE1-YYYY PIC 9(4) USAGE DISPLAY.
059219120216                       10 FILLER   PIC X(1).
059220120612                       10 DATE1-MM PIC 9(2) USAGE DISPLAY.
059221120216                       10 FILLER   PIC X(1).
059222120612                       10 DATE1-DD PIC 9(2) USAGE DISPLAY.
059223120216                   05  DATE2.
059224120612                       10 DATE2-MM PIC 9(2) USAGE DISPLAY.
059225120216                       10 FILLER   PIC X(1).
059226120612                       10 DATE2-DD PIC 9(2) USAGE DISPLAY.
059227120216                       10 FILLER   PIC X(1).
059228120612                       10 DATE2-YYYY PIC 9(4) USAGE DISPLAY.
059229120216                   05  DATE3.
059230120612                       10 DATE3-MM PIC 9(2) USAGE DISPLAY.
059231120612                       10 DATE3-DD PIC 9(2) USAGE DISPLAY.
059232120612                       10 DATE3-YYYY PIC 9(4) USAGE DISPLAY.
059233120612                   05  TIME1.
059234120612                       10 TIME1-HH PIC 9(2) USAGE DISPLAY.
059235120612                       10 FILLER   PIC X(1).
059236120612                       10 TIME1-MM PIC 9(2) USAGE DISPLAY.
059237120612                       10 FILLER   PIC X(1).
059238120612                       10 TIME1-SS PIC 9(2) USAGE DISPLAY.
059239120612                   05  TIME2.
059240120612                       10 TIME2-HH PIC 9(2) USAGE DISPLAY.
059241120612                       10 FILLER   PIC X(1).
059242120612                       10 TIME2-MM PIC 9(2) USAGE DISPLAY.
059243120612                       10 FILLER   PIC X(1).
059244120612                       10 TIME2-SS PIC 9(2) USAGE DISPLAY.
059245120612                   05  TIME3.
059246120612                       10 TIME3-HH PIC 9(2) USAGE DISPLAY.
059247120612                       10 TIME3-MM PIC 9(2) USAGE DISPLAY.
059248120612                       10 TIME3-SS PIC 9(2) USAGE DISPLAY.
059249120612                   05  TIMESTAMP1.
059250120612                       10 TS-YYYY  PIC 9(4) USAGE DISPLAY.
059251120216                       10 FILLER   PIC X(1).
059252120612                       10 TS-MM    PIC 9(2) USAGE DISPLAY.
059253120216                       10 FILLER   PIC X(1).
059254120612                       10 TS-DD    PIC 9(2) USAGE DISPLAY.
059255120216                       10 FILLER   PIC X(1).
059256120612                       10 TS-HH    PIC 9(2) USAGE DISPLAY.
059257120216                       10 FILLER   PIC X(1).
059258120612                       10 TS-MIN   PIC 9(2) USAGE DISPLAY.
059259120216                       10 FILLER   PIC X(1).
059260120612                       10 TS-SS    PIC 9(2) USAGE DISPLAY.
059261120216                       10 FILLER   PIC X(1).
059262120216                       10 TS-MS    PIC 9(6) USAGE DISPLAY.
059263120216                   05  FLOAT4      COMP-1.
059264120216                   05  FLOAT8      COMP-2.
059265120606               04 CHAR20-DATA.
059266120612                   05  CHAR20A      PIC X(20) OCCURS 4 TIMES.
059267120606               04 LCHAR20-DATA.
059268120612                   05  LCHAR20A      PIC X(20) OCCURS 4 TIMES.
059269120606               04 UNICODE-DATA.
059270120612                   05  UNICODE20A   PIC N(20) USAGE NATIONAL
059271120606                           OCCURS 4 TIMES.
059272120606               04 LUNICODE-DATA.
059273120612                   05  LUNICODE20A   PIC N(20) USAGE NATIONAL
059274120606                           OCCURS 4 TIMES.
059275120216               04 BIN2SIGN-DATA.
059276120216                   05  BIN2SIGNA    PIC S9(4) COMP-4 OCCURS 4 TIMES.
059277120216               04 BIN4SIGN-DATA.
059278120216                   05  BIN4SIGNA    PIC S9(9) COMP-4 OCCURS 4 TIMES.
059279120216               04 BIN8SIGN-DATA.
059280120216                   05  BIN8SIGNA    PIC S9(18) COMP-4 OCCURS 4 TIMES.
059281120216               04 DEC112-DATA.
059282120216                   05  DEC112A      PIC S9(9)V9(2) COMP-3
059283120216                                       OCCURS 4 TIMES.
059284120216               04 DEC15-DATA.
059285120216                   05  DEC15A       PIC S9(15) COMP-3 OCCURS 4 TIMES.
059286120216               04 NUM6-DATA.
059287120216                   05  NUM6A        PIC S9(6) OCCURS 4 TIMES.
059288120216               04 NUM103-DATA.
059289120216                   05  NUM103A      PIC S9(7)V9(3) OCCURS 4 TIMES.
059290120216               04 BIN2-DATA.
059291120216                   05  BIN2A        PIC 9(4) COMP-4 OCCURS 4 TIMES.
059292120216               04 BIN4-DATA.
059293120216                   05  BIN4A        PIC 9(9) COMP-4 OCCURS 4 TIMES.
059294120216               04 DATE1-DATA.
059295120216                   05 DATE1A  OCCURS 4 TIMES.
059296120612                       10 DATE1-YA PIC 9(4) USAGE DISPLAY.
059297120216                       10 FILLER   PIC X(1).
059298120612                       10 DATE1-MA PIC 9(2) USAGE DISPLAY.
059299120216                       10 FILLER   PIC X(1).
059300120612                       10 DATE1-DA PIC 9(2) USAGE DISPLAY.
059301120216               04 DATE2-DATA.
059302120216                   05 DATE2A  OCCURS 4 TIMES.
059303120612                       10 DATE2-MA PIC 9(2) USAGE DISPLAY.
059304120216                       10 FILLER   PIC X(1).
059305120612                       10 DATE2-DA PIC 9(2) USAGE DISPLAY.
059306120216                       10 FILLER   PIC X(1).
059307120612                       10 DATE2-YA PIC 9(4) USAGE DISPLAY.
059308120216               04 DATE3-DATA.
059309120216                   05 DATE3A  OCCURS 4 TIMES.
059310120612                       10 DATE3-MA PIC 9(2) USAGE DISPLAY.
059311120612                       10 DATE3-DA PIC 9(2) USAGE DISPLAY.
059312120612                       10 DATE3-YA PIC 9(4) USAGE DISPLAY.
059313120606               04 TIME1-DATA.
059314120612                   05  TIME1A  OCCURS 4 TIMES.
059315120612                       10 TIME1-HA PIC 9(2) USAGE DISPLAY.
059316120606                       10 FILLER   PIC X(1).
059317120612                       10 TIME1-MA  PIC 9(2) USAGE DISPLAY.
059318120606                       10 FILLER   PIC X(1).
059319120612                       10 TIME1-SA PIC 9(2) USAGE DISPLAY.
059320120606               04 TIME2-DATA.
059321120612                   05  TIME2A  OCCURS 4 TIMES.
059322120612                       10 TIME2-HA PIC 9(2) USAGE DISPLAY.
059323120606                       10 FILLER   PIC X(1).
059324120612                       10 TIME2-MA PIC 9(2) USAGE DISPLAY.
059325120606                       10 FILLER   PIC X(1).
059326120612                       10 TIME2-SA PIC 9(2) USAGE DISPLAY.
059327120606               04 TIME3-DATA.
059328120612                   05  TIME3A  OCCURS 4 TIMES.
059329120612                       10 TIME3-HA PIC 9(2) USAGE DISPLAY.
059330120612                       10 TIME3-MA PIC 9(2) USAGE DISPLAY.
059331120612                       10 TIME3-SA PIC 9(2) USAGE DISPLAY.
059332120606               04 TIMESTAMP1-DATA.
059333120216                   05  TIMESTAMP1A OCCURS 4 TIMES.
059334120612                       10 TS-YA  PIC 9(4) USAGE DISPLAY.
059335120216                       10 FILLER   PIC X(1).
059336120612                       10 TS-MA    PIC 9(2) USAGE DISPLAY.
059337120216                       10 FILLER   PIC X(1).
059338120612                       10 TS-DA    PIC 9(2) USAGE DISPLAY.
059339120216                       10 FILLER   PIC X(1).
059340120612                       10 TS-HA    PIC 9(2) USAGE DISPLAY.
059341120216                       10 FILLER   PIC X(1).
059342120612                       10 TS-MIA   PIC 9(2) USAGE DISPLAY.
059343120216                       10 FILLER   PIC X(1).
059344120612                       10 TS-SA   PIC 9(2) USAGE DISPLAY.
059345120216                       10 FILLER   PIC X(1).
059346120216                       10 TS-MSA   PIC 9(6) USAGE DISPLAY.
059347120216               04 FLOAT4-DATA.
059348120216                   05  FLOAT4A      COMP-1 OCCURS 4 TIMES.
059349120216               04 FLOAT8-DATA.
059350120216                   05  FLOAT8A      COMP-2 OCCURS 4 TIMES.
059351120216               04  RECA.
059352120216                   05  RECORD1      OCCURS 4 TIMES.
059353120216                       07  CHAR20R      PIC X(20).
059354120606                       07  LCHAR20R      PIC X(20).
059355120606                       07  UNICODE20R   PIC N(20) USAGE NATIONAL.
059356120606                       07  LUNICODE20R   PIC N(20) USAGE NATIONAL.
059357120606                       07  BIN2SIGNR    PIC S9(4) COMP-4.
059358120216                       07  BIN4SIGNR    PIC S9(9) COMP-4.
059359120216                       07  BIN8SIGNR    PIC S9(18) COMP-4.
059360120216                       07  DEC112R      PIC S9(9)V9(2) COMP-3.
059361120216                       07  DEC15R       PIC S9(15) COMP-3.
059362120216                       07  NUM6R        PIC S9(6).
059363120216                       07  NUM103R      PIC S9(7)V9(3).
059364120216                       07  BIN2R        PIC 9(4) COMP-4.
059365120216                       07  BIN4R        PIC 9(9) COMP-4.
059366120216                       07  DATE1R.
059367120612                           10 DATE1-YR PIC 9(4) USAGE DISPLAY.
059368120216                           10 FILLER   PIC X(1).
059369120612                           10 DATE1-MR PIC 9(2) USAGE DISPLAY.
059370120216                           10 FILLER   PIC X(1).
059371120612                           10 DATE1-DR PIC 9(2) USAGE DISPLAY.
059372120216                       07  DATE2R.
059373120612                           10 DATE2-MR PIC 9(2) USAGE DISPLAY.
059374120216                           10 FILLER   PIC X(1).
059375120612                           10 DATE2-DR PIC 9(2) USAGE DISPLAY.
059376120216                           10 FILLER   PIC X(1).
059377120612                           10 DATE2-YR PIC 9(4) USAGE DISPLAY.
059378120216                       07  DATE3R.
059379120612                           10 DATE3-MR PIC 9(2) USAGE DISPLAY.
059380120612                           10 DATE3-DR PIC 9(2) USAGE DISPLAY.
059381120612                           10 DATE3-YR PIC 9(4) USAGE DISPLAY.
059382120606                       07  TIME1R.
059383120612                           10 TIME1-HR PIC 9(2) USAGE DISPLAY.
059384120606                           10 FILLER   PIC X(1).
059385120612                           10 TIME1-MR  PIC 9(2) USAGE DISPLAY.
059386120606                           10 FILLER   PIC X(1).
059387120612                           10 TIME1-SR PIC 9(2) USAGE DISPLAY.
059388120606                       07  TIME2R.
059389120612                           10 TIME2-HR PIC 9(2) USAGE DISPLAY.
059390120606                           10 FILLER   PIC X(1).
059391120612                           10 TIME2-MR PIC 9(2) USAGE DISPLAY.
059392120606                           10 FILLER   PIC X(1).
059393120612                           10 TIME2-SR PIC 9(2) USAGE DISPLAY.
059394120606                       07  TIME3R.
059395120612                           10 TIME3-HR PIC 9(2) USAGE DISPLAY.
059396120612                           10 TIME3-MR PIC 9(2) USAGE DISPLAY.
059397120612                           10 TIME3-SR PIC 9(2) USAGE DISPLAY.
059398120606                       07  TIMESTAMP1R.
059399120612                           10 TS-YR  PIC 9(4) USAGE DISPLAY.
059400120216                           10 FILLER   PIC X(1).
059401120612                           10 TS-MR    PIC 9(2) USAGE DISPLAY.
059402120216                           10 FILLER   PIC X(1).
059403120612                           10 TS-DR    PIC 9(2) USAGE DISPLAY.
059404120216                           10 FILLER   PIC X(1).
059405120612                           10 TS-HR    PIC 9(2) USAGE DISPLAY.
059406120216                           10 FILLER   PIC X(1).
059407120612                           10 TS-MIR   PIC 9(2) USAGE DISPLAY.
059408120216                           10 FILLER   PIC X(1).
059409120612                           10 TS-SR    PIC 9(2) USAGE DISPLAY.
059410120216                           10 FILLER   PIC X(1).
059411120216                           10 TS-MSR    PIC 9(6) USAGE DISPLAY.
059412120216                       07  FLOAT4R      COMP-1.
059413120216                       07  FLOAT8R      COMP-2.
059414120216               04  VALIDCOUNT    PIC S9(9) COMP-4.
059415120216       01 VALIDCOUNTP   PIC S9(9) COMP-4.
059416120216
059417120210
059700120216       PROCEDURE DIVISION USING TYPERECS VALIDCOUNTP.
059800120210      *            CHAR20
059801120210      *            BIN2SIGN
059802120210      *            BIN4SIGN
059803120210      *            BIN8SIGN
059804120210      *            DEC112
059805120210      *            NUM6
059806120210      *            BIN2
059807120210      *            BIN4
059808120210      *            DATE1
059809120210      *            TIME1
059810120210      *            TIMESTAMP1
059811120210      *            FLOAT4
059812120210      *            FLOAT8.
059813120210
059900000000      *-----------------------------------------------------------------
060000000000      * MAIN PROCESS
060100000000      *-----------------------------------------------------------------
060200120203       MAIN-PARA SECTION.
060201120216           PERFORM WITH TEST BEFORE VARYING CNTR1 FROM 1 BY 1 UNTIL
060202120216               CNTR1 > 2
060203120606                DISPLAY "CHAR20." CNTR1 " = " CHAR20(CNTR1)
060204120606                DISPLAY "LCHAR20." CNTR1 " = " LCHAR20(CNTR1)
060205120606                DISPLAY "UNICODE20." CNTR1 " = " UNICODE20(CNTR1)
060206120606                DISPLAY "LUNICODE20." CNTR1 " = " LUNICODE20(CNTR1)
060207120606                DISPLAY "BIN2SIGN." CNTR1 " = " BIN2SIGN(CNTR1)
060208120216                DISPLAY "BIN4SIGN." CNTR1 " = " BIN4SIGN(CNTR1)
060209120216                DISPLAY "BIN8SIGN." CNTR1 " = " BIN8SIGN(CNTR1)
060210120216                DISPLAY "DEC112." CNTR1 " = " DEC112(CNTR1)
060211120216                DISPLAY "DEC15." CNTR1 " = " DEC15(CNTR1)
060212120216                DISPLAY "NUM6." CNTR1 " = " NUM6(CNTR1)
060213120216                DISPLAY "NUM103." CNTR1 " = " NUM103(CNTR1)
060214120216                DISPLAY "BIN2." CNTR1 " = " BIN2(CNTR1)
060215120216                DISPLAY "BIN4." CNTR1 " = " BIN4(CNTR1)
060216120216                DISPLAY "DATE." CNTR1 " = " DATE1(CNTR1)
060217120216                DISPLAY "DATE2." CNTR1 " = " DATE2(CNTR1)
060218120216                DISPLAY "DATE3." CNTR1 " = " DATE3(CNTR1)
060219120606                DISPLAY "TIME1." CNTR1 " = " TIME1(CNTR1)
060220120606                DISPLAY "TIME2." CNTR1 " = " TIME2(CNTR1)
060221120606                DISPLAY "TIME3." CNTR1 " = " TIME3(CNTR1)
060222120606                DISPLAY "TIMESTAMP." CNTR1 " = " TIMESTAMP1(CNTR1)
060223120216                DISPLAY "FLOAT4." CNTR1 " = " FLOAT4(CNTR1)
060224120216                DISPLAY "FLOAT." CNTR1 " = " FLOAT8(CNTR1)
060225120215
060226120216                MOVE "YYYYY" TO CHAR20(CNTR1)(5:5)
060227120606                MOVE "YYYYY" TO LCHAR20(CNTR1)(5:5)
060228120606                MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060229120216                     TO UNICODE20(CNTR1)(5:10)
060230120606                MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060231120606                     TO LUNICODE20(CNTR1)(5:10)
060232120606                COMPUTE BIN2SIGN(CNTR1) = BIN2SIGN(CNTR1) + 98
060233120216                COMPUTE BIN4SIGN(CNTR1) = BIN4SIGN(CNTR1) + 998
060234120216                COMPUTE BIN8SIGN(CNTR1) = BIN8SIGN(CNTR1) + 9998
060235120216                COMPUTE DEC112(CNTR1) = DEC112(CNTR1) + 998
060236120216                COMPUTE DEC15(CNTR1) = DEC15(CNTR1) + 998
060237120216                COMPUTE NUM6(CNTR1) = NUM6(CNTR1) + 9998
060238120216                COMPUTE NUM103(CNTR1) = NUM103(CNTR1) + 9998
060239120216                COMPUTE BIN2(CNTR1) = BIN2(CNTR1) + 98
060240120216                COMPUTE BIN4(CNTR1) = BIN4(CNTR1) + 998
060241120215
060242120215      *    DATE1 FORMAT YYYY-MM-DD
060243120216                COMPUTE DATE1-YYYY(CNTR1) = DATE1-YYYY(CNTR1) + 5
060244120216                COMPUTE DATE1-MM(CNTR1) = DATE1-MM(CNTR1) + 5
060245120216                COMPUTE DATE1-DD(CNTR1) = DATE1-DD(CNTR1) + 5
060246120215
060247120215      *    DATE2 FORMAT MM/DD/YYYY
060248120216                COMPUTE DATE2-YYYY(CNTR1) = DATE2-YYYY(CNTR1) + 5
060249120216                COMPUTE DATE2-MM(CNTR1) = DATE2-MM(CNTR1) + 5
060250120216                COMPUTE DATE2-DD(CNTR1) = DATE2-DD(CNTR1) + 5
060251120215
060252120215      *    DATE3 FORMAT MMDDYYYY
060253120216                COMPUTE DATE3-YYYY(CNTR1) = DATE3-YYYY(CNTR1) + 5
060254120216                COMPUTE DATE3-MM(CNTR1) = DATE3-MM(CNTR1) + 5
060255120216                COMPUTE DATE3-DD(CNTR1) = DATE3-DD(CNTR1) + 5
060256120215
060257120606      *    TIME1 FORMAT
060258120606                COMPUTE TIME1-HH(CNTR1) = TIME1-HH(CNTR1) + 5
060259120606                COMPUTE TIME1-MM(CNTR1) = TIME1-MM(CNTR1) + 5
060260120606                COMPUTE TIME1-SS(CNTR1) = TIME1-SS(CNTR1) + 5
060261120606
060263120606      *    TIME2 FORMAT
060264120606                COMPUTE TIME2-HH(CNTR1) = TIME2-HH(CNTR1) + 5
060265120606                COMPUTE TIME2-MM(CNTR1) = TIME2-MM(CNTR1) + 5
060266120612                COMPUTE TIME2-SS(CNTR1) = TIME2-SS(CNTR1) + 5
060267120606
060269120606      *    TIME3 FORMAT
060270120606                COMPUTE TIME3-HH(CNTR1) = TIME3-HH(CNTR1) + 5
060271120606                COMPUTE TIME3-MM(CNTR1) = TIME3-MM(CNTR1) + 5
060272120606                COMPUTE TIME3-SS(CNTR1) = TIME3-SS(CNTR1) + 5
060273120606
060275120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060276120216                COMPUTE TS-YYYY(CNTR1) = TS-YYYY(CNTR1) + 5
060277120216                COMPUTE TS-MM(CNTR1) = TS-MM(CNTR1) + 5
060278120216                COMPUTE TS-DD(CNTR1) = TS-DD(CNTR1) + 5
060279120216                COMPUTE TS-HH(CNTR1) = TS-HH(CNTR1) + 5
060280120216                COMPUTE TS-MIN(CNTR1) = TS-MIN(CNTR1) + 5
060281120216                COMPUTE TS-SS(CNTR1) = TS-SS(CNTR1) + 5
060282120216                COMPUTE FLOAT4(CNTR1) = FLOAT4(CNTR1) + 9.9e-1
060283120216                COMPUTE FLOAT8(CNTR1) = FLOAT8(CNTR1) + 9.9e-1
060284120215
060285120216               PERFORM WITH TEST BEFORE VARYING CNTR2 FROM 1 BY 1
060286120216                   UNTIL CNTR2 > 2
060287120216                   DISPLAY "CHAR20." CNTR1 "." CNTR2 " = "
060288120216                        CHAR20A(CNTR1 CNTR2)
060289120606                   DISPLAY "LCHAR20." CNTR1 "." CNTR2 " = "
060290120606                        LCHAR20A(CNTR1 CNTR2)
060291120606                   DISPLAY "UNICODE20." CNTR1 "." CNTR2 " = "
060292120216                       UNICODE20A(CNTR1 CNTR2)
060293120606                   DISPLAY "LUNICODE20." CNTR1 "." CNTR2 " = "
060294120606                       LUNICODE20A(CNTR1 CNTR2)
060295120606                   DISPLAY "BIN2SIGN." CNTR1 "." CNTR2 " = "
060296120216                       BIN2SIGNA(CNTR1 CNTR2)
060297120216                   DISPLAY "BIN4SIGN." CNTR1 "." CNTR2 " = "
060298120216                       BIN4SIGNA(CNTR1 CNTR2)
060299120216                   DISPLAY "BIN8SIGN." CNTR1 "." CNTR2 " = "
060300120216                       BIN8SIGNA(CNTR1 CNTR2)
060301120216                   DISPLAY "DEC112." CNTR1 "." CNTR2 " = "
060302120216                       DEC112A(CNTR1 CNTR2)
060303120216                   DISPLAY "DEC15." CNTR1 "." CNTR2 " = "
060304120216                       DEC15A(CNTR1 CNTR2)
060305120216                   DISPLAY "NUM6" CNTR1 "." CNTR2 " = "
060306120216                       NUM6A(CNTR1 CNTR2)
060307120216                   DISPLAY "NUM103" CNTR1 "." CNTR2 " = "
060308120216                       NUM103A(CNTR1 CNTR2)
060309120216                   DISPLAY "BIN2" CNTR1 "." CNTR2 " = "
060310120216                       BIN2A(CNTR1 CNTR2)
060311120216                   DISPLAY "BIN4" CNTR1 "." CNTR2 " = "
060312120216                       BIN4A(CNTR1 CNTR2)
060313120216                   DISPLAY "DATE1" CNTR1 "." CNTR2 " = "
060314120216                       DATE1A(CNTR1 CNTR2)
060315120606                   DISPLAY "DATE2" CNTR1 "." CNTR2 " = "
060316120606                       DATE2A(CNTR1 CNTR2)
060317120606                   DISPLAY "DATE3" CNTR1 "." CNTR2 " = "
060318120606                       DATE3A(CNTR1 CNTR2)
060319120606                   DISPLAY "TIME1" CNTR1 "." CNTR2 " = "
060320120612                       TIME1A(CNTR1 CNTR2)
060321120606                   DISPLAY "TIME2" CNTR1 "." CNTR2 " = "
060322120612                       TIME2A(CNTR1 CNTR2)
060323120612                   DISPLAY "TIME3" CNTR1 "." CNTR2 " = "
060324120612                       TIME3A(CNTR1 CNTR2)
060325120606                   DISPLAY "TIMESTAMP1" CNTR1 "." CNTR2 " = "
060326120216                       TIMESTAMP1A(CNTR1 CNTR2)
060327120216                   DISPLAY "FLOAT4" CNTR1 "." CNTR2 " = "
060328120216                       FLOAT4A(CNTR1 CNTR2)
060329120216                   DISPLAY "FLOAT8" CNTR1 "." CNTR2 " = "
060330120216                       FLOAT8A(CNTR1 CNTR2)
060331120216
060332120216                   MOVE "YYYYY" TO CHAR20A(CNTR1 CNTR2)(5:5)
060333120606                   MOVE "YYYYY" TO LCHAR20A(CNTR1 CNTR2)(5:5)
060334120606                   MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060335120216                       TO UNICODE20A(CNTR1 CNTR2)(5:10)
060336120606                   MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060337120606                       TO LUNICODE20A(CNTR1 CNTR2)(5:10)
060338120606                   COMPUTE BIN2SIGNA(CNTR1 CNTR2) =
060339120216                       BIN2SIGNA(CNTR1 CNTR2) + 98
060340120216
060341120216                   COMPUTE BIN4SIGNA(CNTR1 CNTR2) =
060342120216                       BIN4SIGNA(CNTR1 CNTR2) + 998
060343120216                   COMPUTE BIN8SIGNA(CNTR1 CNTR2) =
060344120216                       BIN8SIGNA(CNTR1 CNTR2) + 9998
060345120216                   COMPUTE DEC112A(CNTR1 CNTR2) =
060346120216                       DEC112A(CNTR1 CNTR2) + 998
060347120216                   COMPUTE DEC15A(CNTR1 CNTR2) =
060348120216                       DEC15A(CNTR1 CNTR2) + 998
060349120216                   COMPUTE NUM6A(CNTR1 CNTR2) =
060350120216                       NUM6A(CNTR1 CNTR2) + 9998
060351120216                   COMPUTE NUM103A(CNTR1 CNTR2) =
060352120216                       NUM103A(CNTR1 CNTR2) + 9998
060353120216                   COMPUTE BIN2A(CNTR1 CNTR2) =
060354120216                        BIN2A(CNTR1 CNTR2) + 98
060355120216                   COMPUTE BIN4A(CNTR1 CNTR2) =
060356120216                       BIN4A(CNTR1 CNTR2) + 998
060357120216
060358120216      *    DATE1 FORMAT YYYY-MM-DD
060359120216                   COMPUTE DATE1-YA(CNTR1 CNTR2) =
060360120216                       DATE1-YA(CNTR1 CNTR2) + 5
060361120216                   COMPUTE DATE1-MA(CNTR1 CNTR2) =
060362120216                       DATE1-MA(CNTR1 CNTR2) + 5
060363120216                   COMPUTE DATE1-DA(CNTR1 CNTR2) =
060364120216                       DATE1-DA(CNTR1 CNTR2) + 5
060365120216
060366120216      *    DATE2 FORMAT MM/DD/YYYY
060367120216                   COMPUTE DATE2-YA(CNTR1 CNTR2) =
060368120216                       DATE2-YA(CNTR1 CNTR2) + 5
060369120216                   COMPUTE DATE2-MA(CNTR1 CNTR2) =
060370120216                       DATE2-MA(CNTR1 CNTR2) + 5
060371120216                   COMPUTE DATE2-DA(CNTR1 CNTR2) =
060372120216                       DATE2-DA(CNTR1 CNTR2) + 5
060373120216
060374120216      *    DATE3 FORMAT MMDDYYYY
060375120216                   COMPUTE DATE3-YA(CNTR1 CNTR2) =
060376120216                       DATE3-YA(CNTR1 CNTR2) + 5
060377120216                   COMPUTE DATE3-MA(CNTR1 CNTR2) =
060378120216                       DATE3-MA(CNTR1 CNTR2) + 5
060379120216                   COMPUTE DATE3-DA(CNTR1 CNTR2) =
060380120216                       DATE3-DA(CNTR1 CNTR2) + 5
060381120216
060382120606      *    TIME1 FORMAT
060383120612                COMPUTE TIME1-HA(CNTR1 CNTR2) =
060384120612                   TIME1-HA(CNTR1 CNTR2) + 5
060385120612                COMPUTE TIME1-MA(CNTR1 CNTR2) =
060386120612                   TIME1-MA(CNTR1 CNTR2) + 5
060387120612                COMPUTE TIME1-SA(CNTR1 CNTR2) =
060388120612                   TIME1-SA(CNTR1 CNTR2) + 5
060389120606
060390120606      *    TIME2 FORMAT
060391120612                COMPUTE TIME2-HA(CNTR1 CNTR2) =
060392120612                   TIME2-HA(CNTR1 CNTR2) + 5
060393120612                COMPUTE TIME2-MA(CNTR1 CNTR2) =
060394120612                   TIME2-MA(CNTR1 CNTR2) + 5
060395120612                COMPUTE TIME2-SA(CNTR1 CNTR2) =
060396120612                   TIME2-SA(CNTR1 CNTR2) + 5
060397120612
060398120606      *    TIME3 FORMAT
060399120612                COMPUTE TIME3-HA(CNTR1 CNTR2) =
060400120612                   TIME3-HA(CNTR1 CNTR2) + 5
060401120612                COMPUTE TIME3-MA(CNTR1 CNTR2) =
060402120612                   TIME3-MA(CNTR1 CNTR2) + 5
060403120612                COMPUTE TIME3-SA(CNTR1 CNTR2) =
060404120612                   TIME3-SA(CNTR1 CNTR2) + 5
060405120606
060406120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060407120216                   COMPUTE TS-YA(CNTR1 CNTR2) =
060408120216                       TS-YA(CNTR1 CNTR2) + 5
060409120216                   COMPUTE TS-MA(CNTR1 CNTR2) =
060410120216                       TS-MA(CNTR1 CNTR2) + 5
060411120216                   COMPUTE TS-DA(CNTR1 CNTR2) =
060412120216                       TS-DA(CNTR1 CNTR2) + 5
060413120216                   COMPUTE TS-HA(CNTR1 CNTR2) =
060414120216                       TS-HA(CNTR1 CNTR2) + 5
060415120216                   COMPUTE TS-MIA(CNTR1 CNTR2) =
060416120216                       TS-MIA(CNTR1 CNTR2) + 5
060417120216                   COMPUTE TS-SA(CNTR1 CNTR2) =
060418120216                       TS-SA(CNTR1 CNTR2) + 5
060419120216                   COMPUTE FLOAT4A(CNTR1 CNTR2) =
060420120216                       FLOAT4A(CNTR1 CNTR2) + 9.9e-1
060421120216                   COMPUTE FLOAT8A(CNTR1 CNTR2) =
060422120216                       FLOAT8A(CNTR1 CNTR2) + 9.9e-1
060423120216
060424120216
060425120216                   DISPLAY "R_CHAR20." CNTR1 "." CNTR2 " = "
060426120216                        CHAR20R(CNTR1 CNTR2)
060427120606                   DISPLAY "R_LCHAR20." CNTR1 "." CNTR2 " = "
060428120606                        LCHAR20R(CNTR1 CNTR2)
060429120606                   DISPLAY "R_UNICODE20." CNTR1 "." CNTR2 " = "
060430120216                       UNICODE20R(CNTR1 CNTR2)
060431120606                   DISPLAY "R_LUNICODE20." CNTR1 "." CNTR2 " = "
060432120606                       LUNICODE20R(CNTR1 CNTR2)
060433120606                   DISPLAY "R_BIN2SIGN." CNTR1 "." CNTR2 " = "
060434120216                       BIN2SIGNR(CNTR1 CNTR2)
060435120216                   DISPLAY "R_BIN4SIGN." CNTR1 "." CNTR2 " = "
060436120216                       BIN4SIGNR(CNTR1 CNTR2)
060437120216                   DISPLAY "R_BIN8SIGN." CNTR1 "." CNTR2 " = "
060438120216                       BIN8SIGNR(CNTR1 CNTR2)
060439120216                   DISPLAY "R_DEC112." CNTR1 "." CNTR2 " = "
060440120216                       DEC112R(CNTR1 CNTR2)
060441120216                   DISPLAY "R_DEC15." CNTR1 "." CNTR2 " = "
060442120216                       DEC15R(CNTR1 CNTR2)
060443120216                   DISPLAY "R_NUM6" CNTR1 "." CNTR2 " = "
060444120216                       NUM6R(CNTR1 CNTR2)
060445120216                   DISPLAY "R_NUM103" CNTR1 "." CNTR2 " = "
060446120216                       NUM103R(CNTR1 CNTR2)
060447120216                   DISPLAY "R_BIN2" CNTR1 "." CNTR2 " = "
060448120216                       BIN2R(CNTR1 CNTR2)
060449120216                   DISPLAY "R_BIN4" CNTR1 "." CNTR2 " = "
060450120216                       BIN4R(CNTR1 CNTR2)
060451120216                   DISPLAY "R_DATE1" CNTR1 "." CNTR2 " = "
060452120216                       DATE1R(CNTR1 CNTR2)
060453120216                   DISPLAY "R_DATE1" CNTR1 "." CNTR2 " = "
060454120216                       DATE2R(CNTR1 CNTR2)
060455120216                   DISPLAY "R_DATE2" CNTR1 "." CNTR2 " = "
060456120216                       DATE3R(CNTR1 CNTR2)
060457120606                   DISPLAY "R_TIME1" CNTR1 "." CNTR2 " = "
060458120606                       TIME1R(CNTR1 CNTR2)
060459120612                   DISPLAY "R_TIME2" CNTR1 "." CNTR2 " = "
060460120606                       TIME2R(CNTR1 CNTR2)
060461120612                   DISPLAY "R_TIME3" CNTR1 "." CNTR2 " = "
060462120606                       TIME3R(CNTR1 CNTR2)
060463120606                   DISPLAY "R_TIMESTAMP1" CNTR1 "." CNTR2 " = "
060464120216                       TIMESTAMP1R(CNTR1 CNTR2)
060465120216                   DISPLAY "R_FLOAT4" CNTR1 "." CNTR2 " = "
060466120216                       FLOAT4R(CNTR1 CNTR2)
060467120216                   DISPLAY "R_FLOAT8" CNTR1 "." CNTR2 " = "
060468120216                       FLOAT8R(CNTR1 CNTR2)
060469120216
060470120217                   DISPLAY "COMPUTE RECA"
060471120216                   MOVE "YYYYY" TO CHAR20R(CNTR1 CNTR2)(5:5)
060472120606                   MOVE "YYYYY" TO LCHAR20R(CNTR1 CNTR2)(5:5)
060473120606                   MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060474120216                       TO UNICODE20R(CNTR1 CNTR2)(5:10)
060475120606                   MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060476120606                       TO LUNICODE20R(CNTR1 CNTR2)(5:10)
060477120606                   COMPUTE BIN2SIGNR(CNTR1 CNTR2) =
060478120216                       BIN2SIGNR(CNTR1 CNTR2) + 98
060479120216
060480120216                   COMPUTE BIN4SIGNR(CNTR1 CNTR2) =
060481120216                       BIN4SIGNR(CNTR1 CNTR2) + 998
060482120216                   COMPUTE BIN8SIGNR(CNTR1 CNTR2) =
060483120216                       BIN8SIGNR(CNTR1 CNTR2) + 9998
060484120216                   COMPUTE DEC112R(CNTR1 CNTR2) =
060485120216                       DEC112R(CNTR1 CNTR2) + 998
060486120216                   COMPUTE DEC15R(CNTR1 CNTR2) =
060487120216                       DEC15R(CNTR1 CNTR2) + 998
060488120216                   COMPUTE NUM6R(CNTR1 CNTR2) =
060489120216                       NUM6R(CNTR1 CNTR2) + 9998
060490120216                   COMPUTE NUM103R(CNTR1 CNTR2) =
060491120216                       NUM103R(CNTR1 CNTR2) + 9998
060492120216                   COMPUTE BIN2R(CNTR1 CNTR2) =
060493120216                        BIN2R(CNTR1 CNTR2) + 98
060494120216                   COMPUTE BIN4R(CNTR1 CNTR2) =
060495120216                       BIN4R(CNTR1 CNTR2) + 998
060496120216
060497120216      *    DATE1 FORMAT YYYY-MM-DD
060498120216                   COMPUTE DATE1-YR(CNTR1 CNTR2) =
060499120216                       DATE1-YR(CNTR1 CNTR2) + 5
060500120216                   COMPUTE DATE1-MR(CNTR1 CNTR2) =
060501120216                       DATE1-MR(CNTR1 CNTR2) + 5
060502120216                   COMPUTE DATE1-DR(CNTR1 CNTR2) =
060503120216                       DATE1-DR(CNTR1 CNTR2) + 5
060504120216
060505120216      *    DATE2 FORMAT MM/DD/YYYY
060506120216                   COMPUTE DATE2-YR(CNTR1 CNTR2) =
060507120216                       DATE2-YR(CNTR1 CNTR2) + 5
060508120216                   COMPUTE DATE2-MR(CNTR1 CNTR2) =
060509120216                       DATE2-MR(CNTR1 CNTR2) + 5
060510120216                   COMPUTE DATE2-DR(CNTR1 CNTR2) =
060511120216                       DATE2-DR(CNTR1 CNTR2) + 5
060512120216
060513120216      *    DATE3 FORMAT MMDDYYYY
060514120216                   COMPUTE DATE3-YR(CNTR1 CNTR2) =
060515120216                       DATE3-YR(CNTR1 CNTR2) + 5
060516120216                   COMPUTE DATE3-MR(CNTR1 CNTR2) =
060517120216                       DATE3-MR(CNTR1 CNTR2) + 5
060518120216                   COMPUTE DATE3-DR(CNTR1 CNTR2) =
060519120216                       DATE3-DR(CNTR1 CNTR2) + 5
060520120216
060521120606      *    TIME1 FORMAT
060522120612                COMPUTE TIME1-HR(CNTR1 CNTR2) =
060523120612                   TIME1-HR(CNTR1 CNTR2) + 5
060524120612                COMPUTE TIME1-MR(CNTR1 CNTR2) =
060525120612                   TIME1-MR(CNTR1 CNTR2) + 5
060526120612                COMPUTE TIME1-SR(CNTR1 CNTR2) =
060527120612                   TIME1-SR(CNTR1 CNTR2) + 5
060528120606
060529120606      *    TIME2 FORMAT
060530120612                COMPUTE TIME2-HR(CNTR1 CNTR2) =
060531120612                   TIME2-HR(CNTR1 CNTR2) + 5
060532120612                COMPUTE TIME2-MR(CNTR1 CNTR2) =
060533120612                   TIME2-MR(CNTR1 CNTR2) + 5
060534120612                COMPUTE TIME2-SR(CNTR1 CNTR2) =
060535120612                   TIME2-MR(CNTR1 CNTR2) + 5
060536120612
060537120606      *    TIME3 FORMAT
060538120612                COMPUTE TIME3-HR(CNTR1 CNTR2) =
060539120612                   TIME3-HR(CNTR1 CNTR2) + 5
060540120612                COMPUTE TIME3-MR(CNTR1 CNTR2) =
060541120612                   TIME3-MR(CNTR1 CNTR2) + 5
060542120612                COMPUTE TIME3-SR(CNTR1 CNTR2) =
060543120612                   TIME3-SR(CNTR1 CNTR2) + 5
060544120606
060545120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060546120216                   COMPUTE TS-YR(CNTR1 CNTR2) =
060547120216                       TS-YR(CNTR1 CNTR2) + 5
060548120216                   COMPUTE TS-MR(CNTR1 CNTR2) =
060549120216                       TS-MR(CNTR1 CNTR2) + 5
060550120216                   COMPUTE TS-DR(CNTR1 CNTR2) =
060551120216                       TS-DR(CNTR1 CNTR2) + 5
060552120216                   COMPUTE TS-HR(CNTR1 CNTR2) =
060553120216                       TS-HR(CNTR1 CNTR2) + 5
060554120216                   COMPUTE TS-MIR(CNTR1 CNTR2) =
060555120216                       TS-MIR(CNTR1 CNTR2) + 5
060556120216                   COMPUTE TS-SR(CNTR1 CNTR2) =
060557120216                       TS-SR(CNTR1 CNTR2) + 5
060558120216                   COMPUTE FLOAT4R(CNTR1 CNTR2) =
060559120216                       FLOAT4R(CNTR1 CNTR2) + 9.9e-1
060560120216                   COMPUTE FLOAT8R(CNTR1 CNTR2) =
060561120216                       FLOAT8R(CNTR1 CNTR2) + 9.9e-1
060562120217
060563120217                   DISPLAY "R_TIMESTAMP1" CNTR1 "." CNTR2 " = "
060564120217                       TIMESTAMP1R(CNTR1 CNTR2)
060565120217
060566120216
060567120216               END-PERFORM
060568120216               MOVE 2 TO VALIDCOUNT(CNTR1)
060569120216           END-PERFORM
060570120216           MOVE 2 TO VALIDCOUNTP
060571120203           PERFORM PARA-1.
060572120203
060573000000           GOBACK.
060574000000
062100120203       PARA-1 SECTION.
063100000000           CONTINUE.
063200120203       PARA-1-X.
063300000000           EXIT.
063400000000
104700000000
104800000000      *-----------------------------------------------------------------
104900120213      * END OF PROGRAM EDTTSTRA
105000000000      *-----------------------------------------------------------------
