000100000000      *-----------------------------------------------------------------
000200120203      * Program to test Data types (primitives) from EGL iSeries access
000300000000      *-----------------------------------------------------------------
000400120203
000800000000       IDENTIFICATION DIVISION.
000900120210       PROGRAM-ID.    EDTTSTPA.
001000000000       AUTHOR.                 NONE
001100000000           INSTALLATION.       NONE
001200120203           DATE WRITTEN.       2/5/2012.
001300000000           DATE COMPILED.
001400000000       ENVIRONMENT DIVISION.
001500000000       CONFIGURATION SECTION.
001600000000       SPECIAL-NAMES.
006100120207       INPUT-OUTPUT SECTION.
006101120207       FILE-CONTROL.
006300000000       DATA DIVISION.
006400000000
006500000000       WORKING-STORAGE SECTION.
006501120210       01 CNTR PIC S9(4) COMP-4.
024600000000       01  CL-CMD.
024700000000           05  CL-CMD-DATA.
024800000000              10  CL-CMD-OVRDBF PIC X(7) VALUE "OVRDBF ".
024900000000              10  CL-CMD-OLDFILE PIC X(11).
025000000000              10  CL-CMD-NEWFILE PIC X(33).
025100000000              10  CL-CMD-SECURE  PIC X(12) VALUE "SECURE(*YES)".
025200000000           05  CL-CMD-LENGTH PIC 9(10)V9(5) COMP-3 VALUE 63.
056800000000       LINKAGE SECTION.
059200120210        01 CHAR20-DATA.
059300120215            05  CHAR20      PIC X(20) OCCURS 4 TIMES.
059301120606        01 LCHAR20-DATA.
059302120606            05  LCHAR20      PIC X(20) OCCURS 4 TIMES.
059303120606        01 UNICODE-DATA.
059304120215            05  UNICODE20   PIC N(20) USAGE NATIONAL OCCURS 4 TIMES.
059305120606        01 LUNICODE-DATA.
059306120606            05  LUNICODE20   PIC N(20) USAGE NATIONAL OCCURS 4 TIMES.
059307120606        01 BIN2SIGN-DATA.
059308120215            05  BIN2SIGN    PIC S9(4) COMP-4 OCCURS 4 TIMES.
059309120210        01 BIN4SIGN-DATA.
059310120215            05  BIN4SIGN    PIC S9(9) COMP-4 OCCURS 4 TIMES.
059311120210        01 BIN8SIGN-DATA.
059312120215            05  BIN8SIGN    PIC S9(18) COMP-4 OCCURS 4 TIMES.
059313120210        01 DEC112-DATA.
059314120215            05  DEC112      PIC S9(9)V9(2) COMP-3 OCCURS 4 TIMES.
059315120215        01 DEC15-DATA.
059316120215            05  DEC15       PIC S9(15) COMP-3 OCCURS 4 TIMES.
059317120210        01 NUM6-DATA.
059318120215            05  NUM6        PIC S9(6) OCCURS 4 TIMES.
059319120215        01 NUM103-DATA.
059320120215            05  NUM103      PIC S9(7)V9(3) OCCURS 4 TIMES.
059321120210        01 BIN2-DATA.
059322120215            05  BIN2        PIC 9(4) COMP-4 OCCURS 4 TIMES.
059323120210        01 BIN4-DATA.
059324120215            05  BIN4        PIC 9(9) COMP-4 OCCURS 4 TIMES.
059325120210        01 DATE1-DATA.
059326120215           05 DATE1  OCCURS 4 TIMES.
059327120612              10 DATE1-YYYY PIC 9(4) USAGE DISPLAY.
059328120215              10 FILLER   PIC X(1).
059329120612              10 DATE1-MM PIC 9(2) USAGE DISPLAY.
059330120215              10 FILLER   PIC X(1).
059331120612              10 DATE1-DD PIC 9(2) USAGE DISPLAY.
059332120215        01 DATE2-DATA.
059333120215           05 DATE2  OCCURS 4 TIMES.
059334120612              10 DATE2-MM PIC 9(2) USAGE DISPLAY.
059335120215              10 FILLER   PIC X(1).
059336120612              10 DATE2-DD PIC 9(2) USAGE DISPLAY.
059337120215              10 FILLER   PIC X(1).
059338120612              10 DATE2-YYYY PIC 9(4) USAGE DISPLAY.
059339120215        01 DATE3-DATA.
059340120215           05 DATE3  OCCURS 4 TIMES.
059341120612              10 DATE3-MM PIC 9(2) USAGE DISPLAY.
059342120612              10 DATE3-DD PIC 9(2) USAGE DISPLAY.
059343120612              10 DATE3-YYYY PIC 9(4) USAGE DISPLAY.
059347120606        01 TIME1-DATA.
059348120606           05  TIME1  OCCURS 4 TIMES.
059349120612              10 TIME1-HH PIC 9(2) USAGE DISPLAY.
059350120606              10 FILLER   PIC X(1).
059351120612              10 TIME1-MM  PIC 9(2) USAGE DISPLAY.
059352120606              10 FILLER   PIC X(1).
059353120612              10 TIME1-SS PIC 9(2) USAGE DISPLAY.
059354120606        01 TIME2-DATA.
059355120606           05  TIME2  OCCURS 4 TIMES.
059356120612              10 TIME2-SS PIC 9(2) USAGE DISPLAY.
059357120606              10 FILLER   PIC X(1).
059358120612              10 TIME2-MM PIC 9(2) USAGE DISPLAY.
059359120606              10 FILLER   PIC X(1).
059360120612              10 TIME2-HH PIC 9(2) USAGE DISPLAY.
059361120606        01 TIME3-DATA.
059362120606           05  TIME3  OCCURS 4 TIMES.
059363120612              10 TIME3-SS PIC 9(2) USAGE DISPLAY.
059364120612              10 TIME3-MM PIC 9(2) USAGE DISPLAY.
059365120612              10 TIME3-HH PIC 9(2) USAGE DISPLAY.
059366120606        01 TIMESTAMP1-DATA.
059367120215           05  TIMESTAMP1 OCCURS 4 TIMES.
059368120612              10 TS-YYYY  PIC 9(4) USAGE DISPLAY.
059369120215              10 FILLER   PIC X(1).
059370120612              10 TS-MM    PIC 9(2) USAGE DISPLAY.
059371120215              10 FILLER   PIC X(1).
059372120612              10 TS-DD    PIC 9(2) USAGE DISPLAY.
059373120215              10 FILLER   PIC X(1).
059374120612              10 TS-HH    PIC 9(2) USAGE DISPLAY.
059375120215              10 FILLER   PIC X(1).
059376120612              10 TS-MIN   PIC 9(2) USAGE DISPLAY.
059377120215              10 FILLER   PIC X(1).
059378120612              10 TS-SS   PIC 9(2) USAGE DISPLAY.
059379120215              10 FILLER   PIC X(1).
059380120215              10 TS-MS   PIC 9(6) USAGE DISPLAY.
059381120215        01 FLOAT4-DATA.
059382120215            05  FLOAT4      COMP-1 OCCURS 4 TIMES.
059383120210        01 FLOAT8-DATA.
059384120215            05  FLOAT8      COMP-2 OCCURS 4 TIMES.
059385120215       01  VALIDCOUNT    PIC S9(9) COMP-4.
059386120215
059700000000       PROCEDURE DIVISION USING
059800120606                   CHAR20-DATA
059801120606                   LCHAR20-DATA
059802120606                   UNICODE-DATA
059803120606                   LUNICODE-DATA
059804120606                   BIN2SIGN-DATA
059805120210                   BIN4SIGN-DATA
059806120210                   BIN8SIGN-DATA
059807120210                   DEC112-DATA
059808120215                   DEC15-DATA
059809120210                   NUM6-DATA
059810120215                   NUM103-DATA
059811120210                   BIN2-DATA
059812120210                   BIN4-DATA
059813120210                   DATE1-DATA
059814120215                   DATE2-DATA
059815120215                   DATE3-DATA
059816120606                   TIME1-DATA
059817120606                   TIME2-DATA
059818120606                   TIME3-DATA
059819120606                   TIMESTAMP1-DATA
059820120210                   FLOAT4-DATA
059821120215                   FLOAT8-DATA
059822120215                   VALIDCOUNT.
059823120210
059900000000      *-----------------------------------------------------------------
060000000000      * MAIN PROCESS
060100000000      *-----------------------------------------------------------------
060200120203       MAIN-PARA SECTION.
060201120207
060202120210           PERFORM WITH TEST BEFORE VARYING CNTR FROM 1 BY 1 UNTIL
060203120210               CNTR > 2
060204120215                DISPLAY "CNTR = " CNTR
060205120606                DISPLAY "CHAR20 = " CHAR20(CNTR)
060206120606                DISPLAY "LCHAR20 = " LCHAR20(CNTR)
060207120606                DISPLAY "UNICODE20 = " UNICODE20(CNTR)
060208120606                DISPLAY "LUNICODE20 = " LUNICODE20(CNTR)
060209120606                DISPLAY "BIN2SIGN = " BIN2SIGN(CNTR)
060210120210                DISPLAY "BIN4SIGN = " BIN4SIGN(CNTR)
060211120210                DISPLAY "BIN8SIGN = " BIN8SIGN(CNTR)
060212120210                DISPLAY "DEC112 = " DEC112(CNTR)
060213120215                DISPLAY "DEC15 = " DEC15(CNTR)
060214120210                DISPLAY "NUM6 = " NUM6(CNTR)
060215120215                DISPLAY "NUM103 = " NUM103(CNTR)
060216120210                DISPLAY "BIN2 = " BIN2(CNTR)
060217120210                DISPLAY "BIN4 = " BIN4(CNTR)
060218120210                DISPLAY "DATE1 = " DATE1(CNTR)
060219120215                DISPLAY "DATE2 = " DATE2(CNTR)
060220120215                DISPLAY "DATE3 = " DATE3(CNTR)
060221120606                DISPLAY "TIME1 = " TIME1(CNTR)
060222120606                DISPLAY "TIME2 = " TIME2(CNTR)
060223120606                DISPLAY "TIME3 = " TIME3(CNTR)
060224120606                DISPLAY "TIMESTAMP1 = " TIMESTAMP1(CNTR)
060225120210                DISPLAY "FLOAT4 = " FLOAT4(CNTR)
060226120210                DISPLAY "FLOAT8 = " FLOAT8(CNTR)
060227120207
060228120215                DISPLAY "COMPUTE"
060229120215                MOVE "YYYYY" TO CHAR20(CNTR)(5:5)
060230120215                DISPLAY "CHAR20 = " CHAR20(CNTR)
060231120606                MOVE "YYYYY" TO LCHAR20(CNTR)(5:5)
060232120606                DISPLAY "LCHAR20 = " LCHAR20(CNTR)
060233120606                MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060234120215                     TO UNICODE20(CNTR)(5:10)
060235120606                DISPLAY "UNICODE20 = " UNICODE20(CNTR)
060236120606                MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060237120606                     TO LUNICODE20(CNTR)(5:10)
060238120606                DISPLAY "LUNICODE20 = " LUNICODE20(CNTR)
060239120215                COMPUTE BIN2SIGN(CNTR) = BIN2SIGN(CNTR) + 98
060240120215                DISPLAY "BIN2SIGN = " BIN2SIGN(CNTR)
060241120215                COMPUTE BIN4SIGN(CNTR) = BIN4SIGN(CNTR) + 998
060242120215                DISPLAY "BIN4SIGN = " BIN4SIGN(CNTR)
060243120215                COMPUTE BIN8SIGN(CNTR) = BIN8SIGN(CNTR) + 9998
060244120215                DISPLAY "BIN8SIGN = " BIN8SIGN(CNTR)
060245120215                COMPUTE DEC112(CNTR) = DEC112(CNTR) + 998
060246120215                DISPLAY "DEC112 = " DEC112(CNTR)
060247120215                COMPUTE DEC15(CNTR) = DEC15(CNTR) + 998
060248120215                DISPLAY "DEC15 = " DEC15(CNTR)
060249120215                COMPUTE NUM6(CNTR) = NUM6(CNTR) + 9998
060250120215                DISPLAY "NUM6 = " NUM6(CNTR)
060251120215                COMPUTE NUM103(CNTR) = NUM103(CNTR) + 9998
060252120215                DISPLAY "NUM103 = " NUM103(CNTR)
060253120215                COMPUTE BIN2(CNTR) = BIN2(CNTR) + 98
060254120215                DISPLAY "BIN2 = " BIN2(CNTR)
060255120215                COMPUTE BIN4(CNTR) = BIN4(CNTR) + 998
060256120215                DISPLAY "BIN4 = " BIN4(CNTR)
060257120215
060258120215      *    DATE1 FORMAT YYYY-MM-DD
060259120215                COMPUTE DATE1-YYYY(CNTR) = DATE1-YYYY(CNTR) + 5
060260120215                COMPUTE DATE1-MM(CNTR) = DATE1-MM(CNTR) + 5
060261120215                COMPUTE DATE1-DD(CNTR) = DATE1-DD(CNTR) + 5
060262120215                DISPLAY "DATE1 = " DATE1(CNTR)
060263120215
060264120215      *    DATE2 FORMAT MM/DD/YYYY
060265120215                COMPUTE DATE2-YYYY(CNTR) = DATE2-YYYY(CNTR) + 5
060266120215                COMPUTE DATE2-MM(CNTR) = DATE2-MM(CNTR) + 5
060267120215                COMPUTE DATE2-DD(CNTR) = DATE2-DD(CNTR) + 5
060268120215                DISPLAY "DATE2 = " DATE2(CNTR)
060269120215
060270120215      *    DATE3 FORMAT MMDDYYYY
060271120215                COMPUTE DATE3-YYYY(CNTR) = DATE3-YYYY(CNTR) + 5
060272120215                COMPUTE DATE3-MM(CNTR) = DATE3-MM(CNTR) + 5
060273120215                COMPUTE DATE3-DD(CNTR) = DATE3-DD(CNTR) + 5
060274120215                DISPLAY "DATE3 = " DATE3(CNTR)
060275120215
060276120606      *    TIME1 FORMAT
060277120606                COMPUTE TIME1-HH(CNTR) = TIME1-HH(CNTR) + 5
060278120606                COMPUTE TIME1-MM(CNTR) = TIME1-MM(CNTR) + 5
060279120606                COMPUTE TIME1-SS(CNTR) = TIME1-SS(CNTR) + 5
060280120606                DISPLAY "TIME1 = " TIME1(CNTR)
060281120606
060282120606      *    TIME2 FORMAT
060283120606                COMPUTE TIME2-HH(CNTR) = TIME2-HH(CNTR) + 5
060284120606                COMPUTE TIME2-MM(CNTR) = TIME2-MM(CNTR) + 5
060285120612                COMPUTE TIME2-SS(CNTR) = TIME2-SS(CNTR) + 5
060286120606                DISPLAY "TIME2 = " TIME2(CNTR)
060287120606
060288120606      *    TIME3 FORMAT
060289120606                COMPUTE TIME3-HH(CNTR) = TIME3-HH(CNTR) + 5
060290120606                COMPUTE TIME3-MM(CNTR) = TIME3-MM(CNTR) + 5
060291120606                COMPUTE TIME3-SS(CNTR) = TIME3-SS(CNTR) + 5
060292120606                DISPLAY "TIME3 = " TIME3(CNTR)
060293120606
060294120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060295120215                COMPUTE TS-YYYY(CNTR) = TS-YYYY(CNTR) + 5
060296120215                COMPUTE TS-MM(CNTR) = TS-MM(CNTR) + 5
060297120215                COMPUTE TS-DD(CNTR) = TS-DD(CNTR) + 5
060298120215                COMPUTE TS-HH(CNTR) = TS-HH(CNTR) + 5
060299120215                COMPUTE TS-MIN(CNTR) = TS-MIN(CNTR) + 5
060300120215                COMPUTE TS-SS(CNTR) = TS-SS(CNTR) + 5
060301120215                DISPLAY "TIMESTAMP1 = " TIMESTAMP1(CNTR)
060302120215                COMPUTE FLOAT4(CNTR) = FLOAT4(CNTR) + 9.9e-1
060303120215                DISPLAY "FLOAT4 = " FLOAT4(CNTR)
060304120215                COMPUTE FLOAT8(CNTR) = FLOAT8(CNTR) + 9.9e-1
060305120215                DISPLAY "FLOAT8 = " FLOAT8(CNTR)
060306120215
060307120215      *          DISPLAY "TIME1 = " TIME1(CNTR)
060308120215           END-PERFORM
060309120215           MOVE 2 TO VALIDCOUNT;
060310120215           PERFORM PARA-1.
060311120203
060400000000           GOBACK.
060500000000
062100120203       PARA-1 SECTION.
063100000000           CONTINUE.
063200120203       PARA-1-X.
063300000000           EXIT.
063400000000
104700000000
104800000000      *-----------------------------------------------------------------
104900120210      * END OF PROGRAM EDTTSTPA
105000000000      *-----------------------------------------------------------------
