000100000000      *-----------------------------------------------------------------
000200120203      * Program to test Data types (primitives) from EGL iSeries access
000300000000      *-----------------------------------------------------------------
000400120203
000800000000       IDENTIFICATION DIVISION.
000900120210       PROGRAM-ID.    EDTTSTR.
001000000000       AUTHOR.                 NONE
001100000000           INSTALLATION.       NONE
001200120203           DATE WRITTEN.       2/5/2012.
001300000000           DATE COMPILED.
001400000000       ENVIRONMENT DIVISION.
001500000000       CONFIGURATION SECTION.
001600000000       SPECIAL-NAMES.
006100120207       INPUT-OUTPUT SECTION.
006101120207       FILE-CONTROL.
006300000000       DATA DIVISION.
006400000000
006500000000       WORKING-STORAGE SECTION.
024600000000       01  CL-CMD.
024700000000           05  CL-CMD-DATA.
024800000000              10  CL-CMD-OVRDBF PIC X(7) VALUE "OVRDBF ".
024900000000              10  CL-CMD-OLDFILE PIC X(11).
025000000000              10  CL-CMD-NEWFILE PIC X(33).
025100000000              10  CL-CMD-SECURE  PIC X(12) VALUE "SECURE(*YES)".
025200000000           05  CL-CMD-LENGTH PIC 9(10)V9(5) COMP-3 VALUE 63.
056800000000       LINKAGE SECTION.
059200120203
059201120210       01 TYPEREC.
059300120606            05  CHAR20      PIC X(20).
059301120606            05  LCHAR20     PIC X(20).
059302120606            05  UNICODE20   PIC N(20) USAGE NATIONAL.
059303120606            05  LUNICODE20  PIC N(20) USAGE NATIONAL.
059304120606            05  BIN2SIGN    PIC S9(4) COMP-4.
059305120210            05  BIN4SIGN    PIC S9(9) COMP-4.
059306120210            05  BIN8SIGN    PIC S9(18) COMP-4.
059307120214            05  DEC112      PIC S9(9)V9(2) COMP-3.
059308120214            05  DEC15       PIC S9(15) COMP-3.
059309120214            05  NUM6        PIC S9(6).
059310120214            05  NUM103      PIC S9(7)V9(3).
059311120214            05  BIN2        PIC 9(4) COMP-4.
059312120214            05  BIN4        PIC 9(9) COMP-4.
059313120214            05  DATE1.
059314120612                10 DATE1-YYYY PIC 9(4) USAGE DISPLAY.
059315120214                10 FILLER   PIC X(1).
059316120612                10 DATE1-MM PIC 9(2) USAGE DISPLAY.
059317120214                10 FILLER   PIC X(1).
059318120612                10 DATE1-DD PIC 9(2) USAGE DISPLAY.
059319120214            05  DATE2.
059320120612                10 DATE2-MM PIC 9(2) USAGE DISPLAY.
059321120214                10 FILLER   PIC X(1).
059322120612                10 DATE2-DD PIC 9(2) USAGE DISPLAY.
059323120214                10 FILLER   PIC X(1).
059324120612                10 DATE2-YYYY PIC 9(4) USAGE DISPLAY.
059325120214            05  DATE3.
059326120612                10 DATE3-MM PIC 9(2) USAGE DISPLAY.
059327120612                10 DATE3-DD PIC 9(2) USAGE DISPLAY.
059328120612                10 DATE3-YYYY PIC 9(4) USAGE DISPLAY.
059329120606            05  TIME1.
059330120612                10 TIME1-HH PIC 9(2) USAGE DISPLAY.
059331120606                10 FILLER   PIC X(1).
059332120612                10 TIME1-MM  PIC 9(2) USAGE DISPLAY.
059333120606                10 FILLER   PIC X(1).
059334120612                10 TIME1-SS PIC 9(2) USAGE DISPLAY.
059335120606            05  TIME2.
059336120612                10 TIME2-SS PIC 9(2) USAGE DISPLAY.
059337120606                10 FILLER   PIC X(1).
059338120612                10 TIME2-MM PIC 9(2) USAGE DISPLAY.
059339120606                10 FILLER   PIC X(1).
059340120612                10 TIME2-HH PIC 9(2) USAGE DISPLAY.
059341120606            05  TIME3.
059342120612                10 TIME3-SS PIC 9(2) USAGE DISPLAY.
059343120612                10 TIME3-MM PIC 9(2) USAGE DISPLAY.
059344120612                10 TIME3-HH PIC 9(2) USAGE DISPLAY.
059345120606            05  TIMESTAMP1.
059346120612                10 TS-YYYY  PIC 9(4) USAGE DISPLAY.
059347120214                10 FILLER   PIC X(1).
059348120612                10 TS-MM    PIC 9(2) USAGE DISPLAY.
059349120214                10 FILLER   PIC X(1).
059350120612                10 TS-DD    PIC 9(2) USAGE DISPLAY.
059351120214                10 FILLER   PIC X(1).
059352120612                10 TS-HH    PIC 9(2) USAGE DISPLAY.
059353120214                10 FILLER   PIC X(1).
059354120612                10 TS-MIN   PIC 9(2) USAGE DISPLAY.
059355120214                10 FILLER   PIC X(1).
059356120612                10 TS-SS    PIC 9(2) USAGE DISPLAY.
059357120215                10 FILLER   PIC X(1).
059358120612                10 TS-MS    PIC 9(6) USAGE DISPLAY.
059359120215            05  FLOAT4      COMP-1.
059360120210            05  FLOAT8      COMP-2.
059361120210
059700120210       PROCEDURE DIVISION USING TYPEREC.
059800120210      *            CHAR20
059801120210      *            BIN2SIGN
059802120210      *            BIN4SIGN
059803120210      *            BIN8SIGN
059804120210      *            DEC112
059805120210      *            NUM6
059806120210      *            BIN2
059807120210      *            BIN4
059808120210      *            DATE1
059809120210      *            TIME1
059810120210      *            TIMESTAMP1
059811120210      *            FLOAT4
059812120210      *            FLOAT8.
059813120210
059900000000      *-----------------------------------------------------------------
060000000000      * MAIN PROCESS
060100000000      *-----------------------------------------------------------------
060200120203       MAIN-PARA SECTION.
060201120210           DISPLAY "TYPEREC = " TYPEREC
060202120207           DISPLAY "CHAR20 = " CHAR20
060203120606           DISPLAY "LCHAR20 = " LCHAR20
060204120606           DISPLAY "UNICODE20 = " UNICODE20
060205120606           DISPLAY "LUNICODE20 = " LUNICODE20
060206120606           DISPLAY "BIN2SIGN = " BIN2SIGN
060207120207           DISPLAY "BIN4SIGN = " BIN4SIGN
060208120207           DISPLAY "BIN8SIGN = " BIN8SIGN
060209120214           DISPLAY "DEC112 = " DEC112
060210120214           DISPLAY "DEC15 = " DEC15
060211120214           DISPLAY "NUM6 = " NUM6
060212120214           DISPLAY "NUM103 = " NUM103
060213120214           DISPLAY "BIN2 = " BIN2
060214120207           DISPLAY "BIN4 = " BIN4
060215120214           DISPLAY "DATE1 = " DATE1
060216120214           DISPLAY "DATE2 = " DATE2
060217120214           DISPLAY "DATE3 = " DATE3
060218120606           DISPLAY "TIME1 = " TIME1
060219120606           DISPLAY "TIME2 = " TIME2
060220120606           DISPLAY "TIME3 = " TIME3
060221120606           DISPLAY "TIMESTAMP1 = " TIMESTAMP1
060222120210           DISPLAY "FLOAT4 = " FLOAT4
060223120210           DISPLAY "FLOAT8 = " FLOAT8
060224120207
060225120215           MOVE "YYYYY" TO CHAR20(5:5)
060226120606           MOVE "YYYYY" TO LCHAR20(5:5)
060227120606           MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060228120215               TO UNICODE20(5:10)
060229120606           MOVE  FUNCTION NATIONAL-OF("ZZZZZZZZZZ")
060230120606               TO LUNICODE20(5:10)
060231120606           COMPUTE BIN2SIGN = BIN2SIGN + 98
060249120207           COMPUTE BIN4SIGN = BIN4SIGN + 998
060250120207           COMPUTE BIN8SIGN = BIN8SIGN + 9998
060251120207           COMPUTE DEC112 = DEC112 + 998
060252120214           COMPUTE DEC15 = DEC15 + 998
060253120214           COMPUTE NUM6 = NUM6 + 9998
060254120214           COMPUTE NUM103 = NUM103 + 9998
060255120207           COMPUTE BIN2 = BIN2 + 98
060256120207           COMPUTE BIN4 = BIN4 + 998
060257120214      *    DATE1 FORMAT YYYY-MM-DD
060258120214           COMPUTE DATE1-YYYY = DATE1-YYYY + 5
060259120214           COMPUTE DATE1-MM = DATE1-MM + 5
060260120214           COMPUTE DATE1-DD = DATE1-DD + 5
060261120214
060262120214      *    DATE2 FORMAT MM/DD/YYYY
060263120214           COMPUTE DATE2-YYYY = DATE2-YYYY + 5
060264120214           COMPUTE DATE2-MM = DATE2-MM + 5
060265120214           COMPUTE DATE2-DD = DATE2-DD + 5
060266120214
060267120214      *    DATE3 FORMAT MMDDYYYY
060268120214           COMPUTE DATE3-YYYY = DATE3-YYYY + 5
060269120214           COMPUTE DATE3-MM = DATE3-MM + 5
060270120214           COMPUTE DATE3-DD = DATE3-DD + 5
060271120214
060272120606      *    TIME1 FORMAT YYYY-MM-DD
060273120606           COMPUTE TIME1-HH = TIME1-HH + 5
060274120606           COMPUTE TIME1-MM = TIME1-MM + 5
060275120606           COMPUTE TIME1-SS = TIME1-SS + 5
060276120606
060277120606      *    TIME2 FORMAT MM/DD/YYYY
060278120606           COMPUTE TIME2-HH = TIME2-HH + 5
060279120606           COMPUTE TIME2-MM = TIME2-MM + 5
060280120612           COMPUTE TIME2-SS = TIME2-SS + 5
060281120606
060282120606      *    TIME3 FORMAT MMDDYYYY
060283120606           COMPUTE TIME3-HH = TIME3-HH + 5
060284120606           COMPUTE TIME3-MM = TIME3-MM + 5
060285120606           COMPUTE TIME3-SS = TIME3-SS + 5
060286120606
060287120606      *    TIMESTAMP1 FORMAT = YYYY-MM-DD-HH.MM.SS
060288120214           COMPUTE TS-YYYY = TS-YYYY + 5
060289120214           COMPUTE TS-MM = TS-MM + 5
060290120214           COMPUTE TS-DD = TS-DD + 5
060291120214           COMPUTE TS-HH = TS-HH + 5
060292120214           COMPUTE TS-MIN = TS-MIN + 5
060293120214           COMPUTE TS-SS = TS-SS + 5
060294120214           COMPUTE FLOAT4 = FLOAT4 + 9.9e-1
060295120210           COMPUTE FLOAT8 = FLOAT8 + 9.9e-1
060296120210
060297120215           DISPLAY "AFTER COMPUTE"
060298120606           DISPLAY "CHAR20 = " CHAR20
060299120606           DISPLAY "LCHAR20 = " LCHAR20
060300120606           DISPLAY "UNICODE20 = " UNICODE20
060301120606           DISPLAY "LUNICODE20 = " LUNICODE20
060302120606           DISPLAY "BIN2SIGN = " BIN2SIGN
060303120215           DISPLAY "BIN4SIGN = " BIN4SIGN
060304120215           DISPLAY "BIN8SIGN = " BIN8SIGN
060305120215           DISPLAY "DEC112 = " DEC112
060306120215           DISPLAY "DEC15 = " DEC15
060307120215           DISPLAY "NUM6 = " NUM6
060308120215           DISPLAY "NUM103 = " NUM103
060309120215           DISPLAY "BIN2 = " BIN2
060310120215           DISPLAY "BIN4 = " BIN4
060311120215           DISPLAY "DATE1 = " DATE1
060312120215           DISPLAY "DATE2 = " DATE2
060313120215           DISPLAY "DATE3 = " DATE3
060314120606           DISPLAY "TIME1 = " TIME1
060315120606           DISPLAY "TIME2 = " TIME2
060316120606           DISPLAY "TIME3 = " TIME3
060317120606           DISPLAY "TIMESTAMP1 = " TIMESTAMP1
060318120215           DISPLAY "FLOAT4 = " FLOAT4
060319120215           DISPLAY "FLOAT8 = " FLOAT8
060320120215           PERFORM PARA-1.
060321120203
060400000000           GOBACK.
060500000000
062100120203       PARA-1 SECTION.
063100000000           CONTINUE.
063200120203       PARA-1-X.
063300000000           EXIT.
063400000000
104700000000
104800000000      *-----------------------------------------------------------------
104900120210      * END OF PROGRAM EDTTSTR
105000000000      *-----------------------------------------------------------------
