define(
//begin v1.x content
{
	"dateFormat-medium": "d ×‘MMM yyyy",
	"dateFormatItem-MMMEd": "E, d ×‘MMM",
	"dateFormatItem-yMEd": "EEE, d.M.yyyy",
	"eraNarrow": [
		"×©× ×ª ×”×™×’×³×¨×”"
	],
	"dateFormatItem-Md": "d/M",
	"months-standAlone-wide": [
		"×ž×•×—×¨×?",
		"×¡×¤×¨",
		"×¨×‘×™×¢ ×?×œ-×?×•×•×?×œ",
		"×¨×‘×™×¢ ×?×œ-×ª× ×™",
		"×’×³×•×ž×“×” ×?×œ-×?×•×•×?×œ",
		"×’×³×•×ž×“×” ×?×œ-×ª× ×™",
		"×¨×’×³×?×‘",
		"×©×¢×‘×?×Ÿ",
		"×¨×?×ž×“×Ÿ",
		"×©×•×•×?×œ",
		"×–×• ×?×œ-QI'DAH",
		"×–×• ×?×œ-×—×™×’×³×”"
	],
	"dateFormatItem-EEEd": "EEE ×”-d",
	"eraNames": [
		"×©× ×ª ×”×™×’×³×¨×”"
	],
	"days-standAlone-narrow": [
		"×?",
		"×‘",
		"×’",
		"×“",
		"×”",
		"×•",
		"×©"
	],
	"dayPeriods-format-wide-pm": "×?×—×”×´×¦",
	"months-standAlone-abbr": [
		"×ž×•×—×¨×?",
		"×¡×¤×¨",
		"×¨×‘×™×¢ ×?×œ-×?×•×•×?×œ",
		"×¨×‘×™×¢ ×?×œ-×ª× ×™",
		"×’×³×•×ž×“×” ×?×œ-×?×•×•×?×œ",
		"×’×³×•×ž×“×” ×?×œ-×ª× ×™",
		"×¨×’×³×?×‘",
		"×©×¢×‘×?×Ÿ",
		"×¨×?×ž×“×Ÿ",
		"×©×•×•×?×œ",
		"×–×• ×?×œ-QI'DAH",
		"×–×• ×?×œ-×—×™×’×³×”"
	],
	"dayPeriods-format-wide-am": "×œ×¤× ×”×´×¦",
	"dateFormat-long": "d ×‘MMMM y",
	"dateFormat-short": "dd/MM/yy",
	"dateFormatItem-yMMMEd": "EEE, d ×‘MMM y",
	"months-format-wide": [
		"×ž×•×—×¨×?",
		"×¡×¤×¨",
		"×¨×‘×™×¢ ×?×œ-×?×•×•×?×œ",
		"×¨×‘×™×¢ ×?×œ-×ª× ×™",
		"×’×³×•×ž×“×” ×?×œ-×?×•×•×?×œ",
		"×’×³×•×ž×“×” ×?×œ-×ª× ×™",
		"×¨×’×³×?×‘",
		"×©×¢×‘×?×Ÿ",
		"×¨×?×ž×“×Ÿ",
		"×©×•×•×?×œ",
		"×–×• ×?×œ-QI'DAH",
		"×–×• ×?×œ-×—×™×’×³×”"
	],
	"dateFormatItem-yM": "M.yyyy",
	"months-format-abbr": [
		"×ž×•×—×¨×?",
		"×¡×¤×¨",
		"×¨×‘×™×¢ ×?×œ-×?×•×•×?×œ",
		"×¨×‘×™×¢ ×?×œ-×ª× ×™",
		"×’×³×•×ž×“×” ×?×œ-×?×•×•×?×œ",
		"×’×³×•×ž×“×” ×?×œ-×ª× ×™",
		"×¨×’×³×?×‘",
		"×©×¢×‘×?×Ÿ",
		"×¨×?×ž×“×Ÿ",
		"×©×•×•×?×œ",
		"×–×• ×?×œ-QI'DAH",
		"×–×• ×?×œ-×—×™×’×³×”"
	],
	"eraAbbr": [
		"×©× ×ª ×”×™×’×³×¨×”"
	],
	"days-format-wide": [
		"×™×•×? ×¨×?×©×•×Ÿ",
		"×™×•×? ×©× ×™",
		"×™×•×? ×©×œ×™×©×™",
		"×™×•×? ×¨×‘×™×¢×™",
		"×™×•×? ×—×ž×™×©×™",
		"×™×•×? ×©×™×©×™",
		"×™×•×? ×©×‘×ª"
	],
	"dateFormatItem-yQ": "yyyy Q",
	"dateFormatItem-yMMM": "MMM y",
	"quarters-format-wide": [
		"×¨×‘×¢×•×Ÿ 1",
		"×¨×‘×¢×•×Ÿ 2",
		"×¨×‘×¢×•×Ÿ 3",
		"×¨×‘×¢×•×Ÿ 4"
	],
	"dateFormat-full": "EEEE, d ×‘MMMM y",
	"dateFormatItem-MMMd": "d ×‘MMM",
	"days-format-abbr": [
		"×™×•×? ×?×³",
		"×™×•×? ×‘×³",
		"×™×•×? ×’×³",
		"×™×•×? ×“×³",
		"×™×•×? ×”×³",
		"×™×•×? ×•×³",
		"×©×‘×ª"
	]
}
//end v1.x content
);