000100120305     H NOMAIN
000101120305
000102120305
000103120305
000104120222     D USANULL         DS
000105120611     D  dMonth                        2s 0
000106120611     D  dDay                          2s 0
000107120611     D  dYear                         4s 0
000108120222
000109120611     D TIMENULLSEP     DS
000110120611     D  tHour                         2s 0
000111120611     D  tMin                          2s 0
000112120611     D  tSec                          2s 0
000113120606
000114120606     D PInts           PR
000115120222     D i1                             3i 0
000116120222     d i2                             5i 0
000117120222     d i4                            10i 0
000118120222     d i8                            20i 0
000119120222
000120120305     D PText           PR
000121120606     D c1                            20a
000122120606     D c2                            20a
000123120606     d u1                            20c
000124120606     d u2                            20c
000125120606
000126120305     D PUints          PR
000127120305     D i1                             3u 0
000128120222     d i2                             5u 0
000129120222     d i4                            10u 0
000130120222     d i8                            20u 0
000131120222
000132120222     D pFlts           PR
000133120222     D f4                             4f
000134120222     D f8                             8f
000135120222
000136120222     D pZone           PR
000137120222     D z112                          11S 2
000138120222     D z150                          15S 0
000139120222
000140120222     D pPack           PR
000141120222     D p174                          17p 4
000142120222     D p80                            8p 0
000143120222
000144120222     D pDate           PR
000145120611     D pd1                             d   datfmt(*ISO)
000146120611     D pd2                             d   datfmt(*USA)
000147120611     D pd3                                 likeds(USANULL)
000148120222
000149120606     D pTime           PR
000150120611     D t1                              T   timfmt(*ISO)
000151120611     D t2                              t   timfmt(*eur)
000152120611     D t3                                  likeds(TIMENULLSEP)
000153120606
000154120606     D pTimeSt         PR
000155120222     D ts                              z
000156120222
000157120222
000158120222
000159120222     P PInts           B                   export
000160120221     D                 PI
000161120222     D i1                             3i 0
000162120222     d i2                             5i 0
000163120222     d i4                            10i 0
000164120222     d i8                            20i 0
000165120222      /free
000166120222       i1 = i1 + 98;
000167120222       i2 = i2 + 998;
000168120222       i4 = i4 + 9998;
000169120222       i8 = i8 + 99998;
000170120222      /end-free
000171120222     p PInts           e
000172120222
000173120222
000174120222     P Puints          B                   export
000175120222     D                 PI
000176120222     D u1                             3u 0
000177120222     d u2                             5u 0
000178120222     d u4                            10u 0
000179120222     d u8                            20u 0
000180120222      /free
000181120222       u1 = u1 + 98;
000182120222       u2 = u2 + 998;
000183120222       u4 = u4 + 9998;
000184120222       u8 = u8 + 99998;
000185120222      /end-free
000186120222     p Puints          e
000187120222
000188120222
000189120222     p pFlts           b                   export
000190120222     D                 PI
000191120222     D f4                             4f
000192120222     d f8                             8f
000193120222
000194120222      /free
000195120222       f4 = f4 + 99e-2;
000196120222       f8 = f8 + 99e-2;
000197120222      /end-free
000198120222     p pFlts           e
000199120222
000200120222
000201120222
000202120222
000203120222     p pZone           b                   export
000204120222     D                 PI
000205120222     D z112                          11S 2
000206120222     D z150                          15S 0
000207120222      /free
000208120222       z112 = z112 + 98;
000209120222       z150 = z150 + 998;
000210120222      /end-free
000211120222     p pZone           e
000212120222
000213120222
000214120222
000215120222
000216120222     P pPack           b                   export
000217120222     D                 PI
000218120222     D p174                          17p 4
000219120222     D p80                            8p 0
000220120222      /free
000221120222       p174 = p174 + 9998;
000222120222       p80 = p80 + 99998;
000223120222      /end-free
000224120222     p pPack           e
000225120222
000226120222
000227120222
000228120305     P pText           b                   export
000229120305     D                 PI
000230120305     D a1                            20a
000231120606     D a2                            20a
000232120606     D u1                            20c
000233120606     D u2                            20c
000234120606
000235120305      /free
000236120305       a1 = %trimr(a1) + 'YYYYY';
000237120606       a2 = %trimr(a2) + 'YYYYY';
000238120606       u1 = %subst(u1:1:4) + %ucs2('ZZZZZZZZZZ');
000239120606       u2 = %subst(u2:1:4) + %ucs2('ZZZZZZZZZZ');
000240120606      /end-free
000241120305     p pText           e
000242120305
000243120305
000244120305     P pDate           b                   export
000245120222     D                 PI
000246120611     D pd1                             d   datfmt(*ISO)
000247120611     D pd2                             d   datfmt(*USA)
000248120611     D pd3                                 likeds(USANULL)
000249120222      /free
000250120611       pd1 = pd1 + %days(5) + %months(5) + %years(5);
000251120611       pd2 = pd2 + %days(5) + %months(5) + %years(5);
000252120611       pd3.dMonth = pd3.dMonth + 5;
000253120611       pd3.dDay =  pd3.dDay + 5;
000254120611       pd3.dYear = pd3.dYear + 5;
000255120222      /end-free
000256120222     p pDate           e
000257120222
000258120222
000259120606     P pTime           b                   export
000260120606     D                 PI
000261120611     D t1                              t   timfmt(*ISO)
000262120611     D t2                              t   timfmt(*EUR)
000263120611     D t3                                  likeds(TIMENULLSEP)
000264120606      /free
000265120611       t1 = t1 + %hours(5) + %minutes(5) + %seconds(5);
000266120611       t2 = t2 + %hours(5) + %minutes(5) + %seconds(5);
000267120611       t3.tHour = t3.tHour + 5;
000268120611       t3.tMin = t3.tMin + 5;
000269120611       t3.tSec = t3.tSec + 5;
000270120606      /end-free
000271120606     p pTime           e
000272120606
000273120606
000274120606     P pTimeST         b                   export
000275120222     D                 PI
000276120222     D ts                              z
000277120222      /free
000278120222       ts = ts + %days(5) + %months(5) + %years(5);
000279120222       ts = ts + %hours(5) + %minutes(5) + %seconds(5);
000280120222      /end-free
000281120222     p pTimeST         e
000282120611
000283120611
000284120222
