000100120305     H NOMAIN
000101120305
000102120305
000103120305
000104120222     D USANULL         DS
000105120611     D  dMonth                        2s 0
000106120611     D  dDay                          2s 0
000107120611     D  dYear                         4s 0
000108120222
000109120611     D TIMENULLSEP     DS
000110120611     D  tHour                         2s 0
000111120611     D  tMin                          2s 0
000112120611     D  tSec                          2s 0
000113120606
000114120606     D PInts           PR
000115120306     D i1                             3i 0 Dim(4)
000116120306     d i2                             5i 0 Dim(4)
000117120306     d i4                            10i 0 Dim(4)
000118120306     d i8                            20i 0 Dim(4)
000119120306     d cnt                           10i 0
000120120306
000121120305     D PText           PR
000122120306     D c1                            20a   Dim(4)
000123120606     D c2                            20a   Dim(4)
000124120606     d u1                            20c   Dim(4)
000125120606     d u2                            20c   Dim(4)
000126120606     d cnt                           10i 0
000127120306
000128120305     D PUints          PR
000129120306     D u1                             3u 0 Dim(4)
000130120306     d u2                             5u 0 Dim(4)
000131120306     d u4                            10u 0 Dim(4)
000132120306     d u8                            20u 0 Dim(4)
000133120306     d cnt                           10i 0
000134120306
000135120222     D pFlts           PR
000136120306     D f4                             4f   Dim(4)
000137120306     D f8                             8f   Dim(4)
000138120306     d cnt                           10i 0
000139120306
000140120222     D pZone           PR
000141120306     D z150                          15S 0 Dim(4)
000142120306     D z112                          11S 2 Dim(4)
000143120306     d cnt                           10i 0
000144120306
000145120222     D pPack           PR
000146120306     D p174                          17p 4 Dim(4)
000147120306     D p80                            8p 0 Dim(4)
000148120306     d cnt                           10i 0
000149120306
000150120222     D pDate           PR
000151120611     D d1                              d   datfmt(*ISO) Dim(4)
000152120611     D d2                              d   datfmt(*EUR) Dim(4)
000153120611     D d3                                  likeds(USANULL) Dim(4)
000154120306     d cnt                           10i 0
000155120306
000156120606     D pTime           PR
000157120611     D t1                              t   timfmt(*ISO) Dim(4)
000158120611     D t2                              t   timfmt(*EUR) Dim(4)
000159120611     D t3                                  likeds(TIMENULLSEP) Dim(4)
000160120606     d cnt                           10i 0
000161120606
000162120222     D pTimeSt         PR
000163120306     D ts                              z   Dim(4)
000164120306     d cnt                           10i 0
000165120306
000166120222
000167120222
000168120222     P PInts           B                   export
000169120221     D                 PI
000170120306     D i1                             3i 0 Dim(4)
000171120306     d i2                             5i 0 Dim(4)
000172120306     d i4                            10i 0 Dim(4)
000173120306     d i8                            20i 0 Dim(4)
000174120306     d cnt                           10i 0
000175120306     d i               S              5i 0
000176120306      /free
000177120306       FOR i = 1 TO 2;
000178120306         i1(i) = i1(i) + 98;
000179120306         i2(i) = i2(i) + 998;
000180120306         i4(i) = i4(i) + 9998;
000181120306         i8(i) = i8(i) + 99998;
000182120306       ENDFOR;
000183120306       cnt = 2;
000184120306      /end-free
000185120222     p PInts           e
000186120222
000187120222
000188120222     P Puints          B                   export
000189120222     D                 PI
000190120306     D u1                             3u 0 Dim(4)
000191120306     d u2                             5u 0 Dim(4)
000192120306     d u4                            10u 0 Dim(4)
000193120306     d u8                            20u 0 Dim(4)
000194120306     d cnt                           10i 0
000195120306     d i               S              5i 0
000196120306      /free
000197120306       FOR i = 1 TO 2;
000198120306         u1(i) = u1(i) + 98;
000199120306         u2(i) = u2(i) + 998;
000200120306         u4(i) = u4(i) + 9998;
000201120306         u8(i) = u8(i) + 99998;
000202120306       endfor;
000203120306       cnt = 2;
000204120306      /end-free
000205120222     p Puints          e
000206120222
000207120222
000208120222     p pFlts           b                   export
000209120222     D                 PI
000210120306     D f4                             4f   Dim(4)
000211120306     d f8                             8f   Dim(4)
000212120306     d cnt                           10i 0
000213120306     d i               S              5i 0
000214120306
000215120222      /free
000216120306       FOR i = 1 TO 2;
000217120306         f4(i) = f4(i) + 99e-2;
000218120306         f8(i) = f8(i) + 99e-2;
000219120306       endfor;
000220120306       cnt = 2;
000221120306      /end-free
000222120222     p pFlts           e
000223120222
000224120222
000225120222
000226120222
000227120222     p pZone           b                   export
000228120222     D                 PI
000229120306     D z150                          15S 0 Dim(4)
000230120306     D z112                          11S 2 Dim(4)
000231120306     d cnt                           10i 0
000232120306     d i               S              5i 0
000233120306      /free
000234120306       FOR i = 1 TO 2;
000235120306         z112(i) = 98 + z112(i);
000236120306         z150(i) = 998 + z150(i);
000237120306       endfor;
000238120306       cnt = 2;
000239120306      /end-free
000240120222     p pZone           e
000241120222
000242120222
000243120222
000244120222
000245120222     P pPack           b                   export
000246120222     D                 PI
000247120306     D p174                          17p 4 Dim(4)
000248120306     D p80                            8p 0 Dim(4)
000249120306     d cnt                           10i 0
000250120306     d i               S              5i 0
000251120306      /free
000252120306       FOR i = 1 TO 2;
000253120306         p174(i) = p174(i) + 9998;
000254120306         p80(i) = p80(i) + 99998;
000255120306       endfor;
000256120306       cnt = 2;
000257120306      /end-free
000258120222     p pPack           e
000259120222
000260120222
000261120222
000262120305     P pText           b                   export
000263120305     D                 PI
000264120306     D c1                            20a   Dim(4)
000265120606     D c2                            20a   Dim(4)
000266120606     d u1                            20c   Dim(4)
000267120606     d u2                            20c   Dim(4)
000268120606     d cnt                           10i 0
000269120306     d i               S              5i 0
000270120306
000271120305      /free
000272120306       FOR i = 1 TO 2;
000273120306         c1(i) = %trimr(c1(i)) + 'YYYYY';
000274120606         c2(i) = %trimr(c2(i)) + 'YYYYY';
000275120606
000276120606         u1(i) = %subst(u1(i):1:4) + %ucs2('ZZZZZZZZZZ');
000277120606         u2(i) = %subst(u2(i):1:4) + %ucs2('ZZZZZZZZZZ');
000278120306       endfor;
000279120306       cnt = 2;
000280120306      /end-free
000281120305     p pText           e
000282120305
000283120606     P pDate           b                   export
000285120222     D                 PI
000286120611     D d1                              d   datfmt(*ISO) Dim(4)
000287120611     D d2                              d   datfmt(*EUR) Dim(4)
000288120611     D d3                                  likeds(USANULL) Dim(4)
000289120306     d cnt                           10i 0
000290120306     d i               S              5i 0
000291120306      /free
000292120306       FOR i = 1 TO 2;
000293120611         d1(i) = d1(i) + %days(5) + %months(5) + %years(5);
000294120611         d2(i) = d2(i) + %days(5) + %months(5) + %years(5);
000295120611         d3(i).dMonth = d3(i).dMonth + 5;
000296120611         d3(i).dDay =  d3(i).dDay + 5;
000297120611         d3(i).dYear = d3(i).dYear + 5;
000298120306       endfor;
000299120306       cnt = 2;
000300120306      /end-free
000301120222     p pDate           e
000302120222
000303120606     P pTime           b                   export
000304120606     D                 PI
000305120611     D t1                              t   timfmt(*ISO) Dim(4)
000306120611     D t2                              t   timfmt(*EUR) Dim(4)
000307120611     D t3                                  likeds(TIMENULLSEP) Dim(4)
000308120606     d cnt                           10i 0
000309120606     d i               S              5i 0
000310120606      /free
000311120606       FOR i = 1 TO 2;
000312120611         t1(i) = t1(i) + %hours(5) + %minutes(5) + %seconds(5);
000313120611         t2(i) = t2(i) + %hours(5) + %minutes(5) + %seconds(5);
000314120611         t3(i).tHour = t3(i).tHour + 5;
000315120611         t3(i).tMin = t3(i).tMin + 5;
000316120611         t3(i).tSec = t3(i).tSec + 5;
000317120606       endfor;
000318120606       cnt = 2;
000319120606      /end-free
000320120611     p pTime           e
000321120606
000322120222
000323120222     P pTimeST         b                   export
000324120222     D                 PI
000325120306     D ts                              z   Dim(4)
000326120306     d cnt                           10i 0
000327120306     d i               S              5i 0
000328120306      /free
000329120306       FOR i = 1 TO 2;
000330120306         ts(i) = ts(i) + %days(5) + %months(5) + %years(5);
000331120306         ts(i) = ts(i) + %hours(5) + %minutes(5) + %seconds(5);
000332120306       endfor;
000333120306       cnt = 2;
000334120306      /end-free
000335120222     p pTimeST         e
000336120222
