define(
//begin v1.x content
{
	"HKD_displayName": "à¸”à¸­à¸¥à¸¥à¸²à¸£à¹Œà¸®à¹ˆà¸­à¸‡à¸?à¸‡",
	"CHF_displayName": "à¸Ÿà¸£à¸±à¸‡à¸?à¹Œà¸ªà¸§à¸´à¸ª",
	"JPY_symbol": "Â¥",
	"CAD_displayName": "à¸”à¸­à¸¥à¸¥à¸²à¸£à¹Œà¹?à¸„à¸™à¸²à¸”à¸²",
	"CNY_displayName": "à¸«à¸¢à¸§à¸™à¹€à¸«à¸£à¸´à¸™à¸«à¸¡à¸´à¸™à¸›à¸µà¹‰ (à¸ªà¸²à¸˜à¸²à¸£à¸“à¸£à¸±à¸?à¸›à¸£à¸°à¸Šà¸²à¸Šà¸™à¸ˆà¸µà¸™)",
	"AUD_displayName": "à¸”à¸­à¸¥à¸¥à¸²à¸£à¹Œà¸­à¸­à¸ªà¹€à¸•à¸£à¹€à¸¥à¸µà¸¢",
	"JPY_displayName": "à¹€à¸¢à¸™à¸?à¸µà¹ˆà¸›à¸¸à¹ˆà¸™",
	"USD_displayName": "à¸”à¸­à¸¥à¸¥à¸²à¸£à¹Œà¸ªà¸«à¸£à¸±à¸?",
	"GBP_displayName": "à¸›à¸­à¸™à¸”à¹Œà¸ªà¹€à¸•à¸­à¸£à¹Œà¸¥à¸´à¸‡ (à¸ªà¸«à¸£à¸²à¸Šà¸­à¸²à¸“à¸²à¸ˆà¸±à¸?à¸£)",
	"EUR_displayName": "à¸¢à¸¹à¹‚à¸£"
}
//end v1.x content
);